Contents of the .debug_info section:

  Compilation Unit @ offset 0x0:
   Length:        0x341 (32-bit)
   Version:       5
   Unit Type:     DW_UT_compile (1)
   Abbrev Offset: 0x0
   Pointer Size:  4
 <0><c>: Abbrev Number: 13 (DW_TAG_compile_unit)
    <d>   DW_AT_producer    : (indirect string, offset: 0x4ec7b): GNU C11 11.3.1 20220712 -mcpu=cortex-m3 -mfloat-abi=soft -mthumb -march=armv7-m -g3 -O0 -std=gnu11 -ffunction-sections -fdata-sections -fstack-usage -fcyclomatic-complexity
    <11>   DW_AT_language    : 29	(C11)
    <12>   DW_AT_name        : (indirect string, offset: 0x6d370): ../Core/Src/main.c
    <16>   DW_AT_comp_dir    : (indirect string, offset: 0x123a4): F:/HEATER SYSTEM PID/CODE/Debug
    <1a>   DW_AT_ranges      : 0xc
    <1e>   DW_AT_low_pc      : 0x0
    <22>   DW_AT_stmt_list   : 0x0
    <26>   DW_AT_macros      : 0x0
 <1><2a>: Abbrev Number: 2 (DW_TAG_base_type)
    <2b>   DW_AT_byte_size   : 1
    <2c>   DW_AT_encoding    : 6	(signed char)
    <2d>   DW_AT_name        : (indirect string, offset: 0x3d7e9): signed char
 <1><31>: Abbrev Number: 2 (DW_TAG_base_type)
    <32>   DW_AT_byte_size   : 1
    <33>   DW_AT_encoding    : 8	(unsigned char)
    <34>   DW_AT_name        : (indirect string, offset: 0x19162): unsigned char
 <1><38>: Abbrev Number: 2 (DW_TAG_base_type)
    <39>   DW_AT_byte_size   : 2
    <3a>   DW_AT_encoding    : 5	(signed)
    <3b>   DW_AT_name        : (indirect string, offset: 0x5b395): short int
 <1><3f>: Abbrev Number: 2 (DW_TAG_base_type)
    <40>   DW_AT_byte_size   : 2
    <41>   DW_AT_encoding    : 7	(unsigned)
    <42>   DW_AT_name        : (indirect string, offset: 0x28427): short unsigned int
 <1><46>: Abbrev Number: 2 (DW_TAG_base_type)
    <47>   DW_AT_byte_size   : 4
    <48>   DW_AT_encoding    : 5	(signed)
    <49>   DW_AT_name        : (indirect string, offset: 0xab4c): long int
 <1><4d>: Abbrev Number: 4 (DW_TAG_typedef)
    <4e>   DW_AT_name        : (indirect string, offset: 0x4dfcc): __uint32_t
    <52>   DW_AT_decl_file   : 3
    <53>   DW_AT_decl_line   : 79
    <54>   DW_AT_decl_column : 25
    <55>   DW_AT_type        : <0x59>
 <1><59>: Abbrev Number: 2 (DW_TAG_base_type)
    <5a>   DW_AT_byte_size   : 4
    <5b>   DW_AT_encoding    : 7	(unsigned)
    <5c>   DW_AT_name        : (indirect string, offset: 0x1cfc3): long unsigned int
 <1><60>: Abbrev Number: 2 (DW_TAG_base_type)
    <61>   DW_AT_byte_size   : 8
    <62>   DW_AT_encoding    : 5	(signed)
    <63>   DW_AT_name        : (indirect string, offset: 0x3861e): long long int
 <1><67>: Abbrev Number: 2 (DW_TAG_base_type)
    <68>   DW_AT_byte_size   : 8
    <69>   DW_AT_encoding    : 7	(unsigned)
    <6a>   DW_AT_name        : (indirect string, offset: 0x1981f): long long unsigned int
 <1><6e>: Abbrev Number: 14 (DW_TAG_base_type)
    <6f>   DW_AT_byte_size   : 4
    <70>   DW_AT_encoding    : 5	(signed)
    <71>   DW_AT_name        : int
 <1><75>: Abbrev Number: 2 (DW_TAG_base_type)
    <76>   DW_AT_byte_size   : 4
    <77>   DW_AT_encoding    : 7	(unsigned)
    <78>   DW_AT_name        : (indirect string, offset: 0xa50f): unsigned int
 <1><7c>: Abbrev Number: 4 (DW_TAG_typedef)
    <7d>   DW_AT_name        : (indirect string, offset: 0x4dfce): uint32_t
    <81>   DW_AT_decl_file   : 4
    <82>   DW_AT_decl_line   : 48
    <83>   DW_AT_decl_column : 20
    <84>   DW_AT_type        : <0x4d>
 <1><88>: Abbrev Number: 15 (DW_TAG_volatile_type)
    <89>   DW_AT_type        : <0x7c>
 <1><8d>: Abbrev Number: 16 (DW_TAG_structure_type)
    <8e>   DW_AT_byte_size   : 40
    <8f>   DW_AT_decl_file   : 5
    <90>   DW_AT_decl_line   : 423
    <92>   DW_AT_decl_column : 9
    <93>   DW_AT_sibling     : <0x10f>
 <2><97>: Abbrev Number: 6 (DW_TAG_member)
    <98>   DW_AT_name        : CR
    <9b>   DW_AT_decl_file   : 5
    <9b>   DW_AT_decl_line   : 425
    <9d>   DW_AT_decl_column : 17
    <9d>   DW_AT_type        : <0x88>
    <a1>   DW_AT_data_member_location: 0
 <2><a2>: Abbrev Number: 3 (DW_TAG_member)
    <a3>   DW_AT_name        : (indirect string, offset: 0x4a7a2): CFGR
    <a7>   DW_AT_decl_file   : 5
    <a7>   DW_AT_decl_line   : 426
    <a9>   DW_AT_decl_column : 17
    <a9>   DW_AT_type        : <0x88>
    <ad>   DW_AT_data_member_location: 4
 <2><ae>: Abbrev Number: 6 (DW_TAG_member)
    <af>   DW_AT_name        : CIR
    <b3>   DW_AT_decl_file   : 5
    <b3>   DW_AT_decl_line   : 427
    <b5>   DW_AT_decl_column : 17
    <b5>   DW_AT_type        : <0x88>
    <b9>   DW_AT_data_member_location: 8
 <2><ba>: Abbrev Number: 3 (DW_TAG_member)
    <bb>   DW_AT_name        : (indirect string, offset: 0x359c9): APB2RSTR
    <bf>   DW_AT_decl_file   : 5
    <bf>   DW_AT_decl_line   : 428
    <c1>   DW_AT_decl_column : 17
    <c1>   DW_AT_type        : <0x88>
    <c5>   DW_AT_data_member_location: 12
 <2><c6>: Abbrev Number: 3 (DW_TAG_member)
    <c7>   DW_AT_name        : (indirect string, offset: 0xe117): APB1RSTR
    <cb>   DW_AT_decl_file   : 5
    <cb>   DW_AT_decl_line   : 429
    <cd>   DW_AT_decl_column : 17
    <cd>   DW_AT_type        : <0x88>
    <d1>   DW_AT_data_member_location: 16
 <2><d2>: Abbrev Number: 3 (DW_TAG_member)
    <d3>   DW_AT_name        : (indirect string, offset: 0xb8d0): AHBENR
    <d7>   DW_AT_decl_file   : 5
    <d7>   DW_AT_decl_line   : 430
    <d9>   DW_AT_decl_column : 17
    <d9>   DW_AT_type        : <0x88>
    <dd>   DW_AT_data_member_location: 20
 <2><de>: Abbrev Number: 3 (DW_TAG_member)
    <df>   DW_AT_name        : (indirect string, offset: 0xeaaf): APB2ENR
    <e3>   DW_AT_decl_file   : 5
    <e3>   DW_AT_decl_line   : 431
    <e5>   DW_AT_decl_column : 17
    <e5>   DW_AT_type        : <0x88>
    <e9>   DW_AT_data_member_location: 24
 <2><ea>: Abbrev Number: 3 (DW_TAG_member)
    <eb>   DW_AT_name        : (indirect string, offset: 0x5c28a): APB1ENR
    <ef>   DW_AT_decl_file   : 5
    <ef>   DW_AT_decl_line   : 432
    <f1>   DW_AT_decl_column : 17
    <f1>   DW_AT_type        : <0x88>
    <f5>   DW_AT_data_member_location: 28
 <2><f6>: Abbrev Number: 3 (DW_TAG_member)
    <f7>   DW_AT_name        : (indirect string, offset: 0x110af): BDCR
    <fb>   DW_AT_decl_file   : 5
    <fb>   DW_AT_decl_line   : 433
    <fd>   DW_AT_decl_column : 17
    <fd>   DW_AT_type        : <0x88>
    <101>   DW_AT_data_member_location: 32
 <2><102>: Abbrev Number: 6 (DW_TAG_member)
    <103>   DW_AT_name        : CSR
    <107>   DW_AT_decl_file   : 5
    <107>   DW_AT_decl_line   : 434
    <109>   DW_AT_decl_column : 17
    <109>   DW_AT_type        : <0x88>
    <10d>   DW_AT_data_member_location: 36
 <2><10e>: Abbrev Number: 0
 <1><10f>: Abbrev Number: 10 (DW_TAG_typedef)
    <110>   DW_AT_name        : (indirect string, offset: 0x393c4): RCC_TypeDef
    <114>   DW_AT_decl_file   : 5
    <115>   DW_AT_decl_line   : 437
    <117>   DW_AT_decl_column : 3
    <117>   DW_AT_type        : <0x8d>
 <1><11b>: Abbrev Number: 2 (DW_TAG_base_type)
    <11c>   DW_AT_byte_size   : 8
    <11d>   DW_AT_encoding    : 4	(float)
    <11e>   DW_AT_name        : (indirect string, offset: 0x1380f): long double
 <1><122>: Abbrev Number: 17 (DW_TAG_enumeration_type)
    <123>   DW_AT_encoding    : 7	(unsigned)
    <124>   DW_AT_byte_size   : 1
    <125>   DW_AT_type        : <0x31>
    <129>   DW_AT_decl_file   : 6
    <12a>   DW_AT_decl_line   : 39
    <12b>   DW_AT_decl_column : 1
    <12c>   DW_AT_sibling     : <0x149>
 <2><130>: Abbrev Number: 5 (DW_TAG_enumerator)
    <131>   DW_AT_name        : (indirect string, offset: 0x297e1): HAL_OK
    <135>   DW_AT_const_value : 0
 <2><136>: Abbrev Number: 5 (DW_TAG_enumerator)
    <137>   DW_AT_name        : (indirect string, offset: 0x4ca0e): HAL_ERROR
    <13b>   DW_AT_const_value : 1
 <2><13c>: Abbrev Number: 5 (DW_TAG_enumerator)
    <13d>   DW_AT_name        : (indirect string, offset: 0x1592a): HAL_BUSY
    <141>   DW_AT_const_value : 2
 <2><142>: Abbrev Number: 5 (DW_TAG_enumerator)
    <143>   DW_AT_name        : (indirect string, offset: 0x243bd): HAL_TIMEOUT
    <147>   DW_AT_const_value : 3
 <2><148>: Abbrev Number: 0
 <1><149>: Abbrev Number: 4 (DW_TAG_typedef)
    <14a>   DW_AT_name        : (indirect string, offset: 0x155c): HAL_StatusTypeDef
    <14e>   DW_AT_decl_file   : 6
    <14f>   DW_AT_decl_line   : 44
    <150>   DW_AT_decl_column : 3
    <151>   DW_AT_type        : <0x122>
 <1><155>: Abbrev Number: 7 (DW_TAG_structure_type)
    <156>   DW_AT_byte_size   : 12
    <157>   DW_AT_decl_file   : 7
    <158>   DW_AT_decl_line   : 47
    <159>   DW_AT_decl_column : 9
    <159>   DW_AT_sibling     : <0x182>
 <2><15d>: Abbrev Number: 1 (DW_TAG_member)
    <15e>   DW_AT_name        : (indirect string, offset: 0x527b8): PLLState
    <162>   DW_AT_decl_file   : 7
    <163>   DW_AT_decl_line   : 49
    <164>   DW_AT_decl_column : 12
    <164>   DW_AT_type        : <0x7c>
    <168>   DW_AT_data_member_location: 0
 <2><169>: Abbrev Number: 1 (DW_TAG_member)
    <16a>   DW_AT_name        : (indirect string, offset: 0x53a31): PLLSource
    <16e>   DW_AT_decl_file   : 7
    <16f>   DW_AT_decl_line   : 52
    <170>   DW_AT_decl_column : 12
    <170>   DW_AT_type        : <0x7c>
    <174>   DW_AT_data_member_location: 4
 <2><175>: Abbrev Number: 1 (DW_TAG_member)
    <176>   DW_AT_name        : (indirect string, offset: 0x6e088): PLLMUL
    <17a>   DW_AT_decl_file   : 7
    <17b>   DW_AT_decl_line   : 55
    <17c>   DW_AT_decl_column : 12
    <17c>   DW_AT_type        : <0x7c>
    <180>   DW_AT_data_member_location: 8
 <2><181>: Abbrev Number: 0
 <1><182>: Abbrev Number: 4 (DW_TAG_typedef)
    <183>   DW_AT_name        : (indirect string, offset: 0x4a4ee): RCC_PLLInitTypeDef
    <187>   DW_AT_decl_file   : 7
    <188>   DW_AT_decl_line   : 57
    <189>   DW_AT_decl_column : 3
    <18a>   DW_AT_type        : <0x155>
 <1><18e>: Abbrev Number: 7 (DW_TAG_structure_type)
    <18f>   DW_AT_byte_size   : 20
    <190>   DW_AT_decl_file   : 7
    <191>   DW_AT_decl_line   : 62
    <192>   DW_AT_decl_column : 9
    <192>   DW_AT_sibling     : <0x1d3>
 <2><196>: Abbrev Number: 1 (DW_TAG_member)
    <197>   DW_AT_name        : (indirect string, offset: 0x25c8f): ClockType
    <19b>   DW_AT_decl_file   : 7
    <19c>   DW_AT_decl_line   : 64
    <19d>   DW_AT_decl_column : 12
    <19d>   DW_AT_type        : <0x7c>
    <1a1>   DW_AT_data_member_location: 0
 <2><1a2>: Abbrev Number: 1 (DW_TAG_member)
    <1a3>   DW_AT_name        : (indirect string, offset: 0x4a11e): SYSCLKSource
    <1a7>   DW_AT_decl_file   : 7
    <1a8>   DW_AT_decl_line   : 67
    <1a9>   DW_AT_decl_column : 12
    <1a9>   DW_AT_type        : <0x7c>
    <1ad>   DW_AT_data_member_location: 4
 <2><1ae>: Abbrev Number: 1 (DW_TAG_member)
    <1af>   DW_AT_name        : (indirect string, offset: 0x65a9c): AHBCLKDivider
    <1b3>   DW_AT_decl_file   : 7
    <1b4>   DW_AT_decl_line   : 70
    <1b5>   DW_AT_decl_column : 12
    <1b5>   DW_AT_type        : <0x7c>
    <1b9>   DW_AT_data_member_location: 8
 <2><1ba>: Abbrev Number: 1 (DW_TAG_member)
    <1bb>   DW_AT_name        : (indirect string, offset: 0x4bbd): APB1CLKDivider
    <1bf>   DW_AT_decl_file   : 7
    <1c0>   DW_AT_decl_line   : 73
    <1c1>   DW_AT_decl_column : 12
    <1c1>   DW_AT_type        : <0x7c>
    <1c5>   DW_AT_data_member_location: 12
 <2><1c6>: Abbrev Number: 1 (DW_TAG_member)
    <1c7>   DW_AT_name        : (indirect string, offset: 0x38ac1): APB2CLKDivider
    <1cb>   DW_AT_decl_file   : 7
    <1cc>   DW_AT_decl_line   : 76
    <1cd>   DW_AT_decl_column : 12
    <1cd>   DW_AT_type        : <0x7c>
    <1d1>   DW_AT_data_member_location: 16
 <2><1d2>: Abbrev Number: 0
 <1><1d3>: Abbrev Number: 4 (DW_TAG_typedef)
    <1d4>   DW_AT_name        : (indirect string, offset: 0x25cdc): RCC_ClkInitTypeDef
    <1d8>   DW_AT_decl_file   : 7
    <1d9>   DW_AT_decl_line   : 78
    <1da>   DW_AT_decl_column : 3
    <1db>   DW_AT_type        : <0x18e>
 <1><1df>: Abbrev Number: 7 (DW_TAG_structure_type)
    <1e0>   DW_AT_byte_size   : 40
    <1e1>   DW_AT_decl_file   : 8
    <1e2>   DW_AT_decl_line   : 226
    <1e3>   DW_AT_decl_column : 9
    <1e3>   DW_AT_sibling     : <0x249>
 <2><1e7>: Abbrev Number: 1 (DW_TAG_member)
    <1e8>   DW_AT_name        : (indirect string, offset: 0x7755): OscillatorType
    <1ec>   DW_AT_decl_file   : 8
    <1ed>   DW_AT_decl_line   : 228
    <1ee>   DW_AT_decl_column : 12
    <1ee>   DW_AT_type        : <0x7c>
    <1f2>   DW_AT_data_member_location: 0
 <2><1f3>: Abbrev Number: 1 (DW_TAG_member)
    <1f4>   DW_AT_name        : (indirect string, offset: 0x526b6): HSEState
    <1f8>   DW_AT_decl_file   : 8
    <1f9>   DW_AT_decl_line   : 236
    <1fa>   DW_AT_decl_column : 12
    <1fa>   DW_AT_type        : <0x7c>
    <1fe>   DW_AT_data_member_location: 4
 <2><1ff>: Abbrev Number: 1 (DW_TAG_member)
    <200>   DW_AT_name        : (indirect string, offset: 0x52eb8): HSEPredivValue
    <204>   DW_AT_decl_file   : 8
    <205>   DW_AT_decl_line   : 239
    <206>   DW_AT_decl_column : 12
    <206>   DW_AT_type        : <0x7c>
    <20a>   DW_AT_data_member_location: 8
 <2><20b>: Abbrev Number: 1 (DW_TAG_member)
    <20c>   DW_AT_name        : (indirect string, offset: 0x4d03b): LSEState
    <210>   DW_AT_decl_file   : 8
    <211>   DW_AT_decl_line   : 242
    <212>   DW_AT_decl_column : 12
    <212>   DW_AT_type        : <0x7c>
    <216>   DW_AT_data_member_location: 12
 <2><217>: Abbrev Number: 1 (DW_TAG_member)
    <218>   DW_AT_name        : (indirect string, offset: 0x371fd): HSIState
    <21c>   DW_AT_decl_file   : 8
    <21d>   DW_AT_decl_line   : 245
    <21e>   DW_AT_decl_column : 12
    <21e>   DW_AT_type        : <0x7c>
    <222>   DW_AT_data_member_location: 16
 <2><223>: Abbrev Number: 1 (DW_TAG_member)
    <224>   DW_AT_name        : (indirect string, offset: 0x69a86): HSICalibrationValue
    <228>   DW_AT_decl_file   : 8
    <229>   DW_AT_decl_line   : 248
    <22a>   DW_AT_decl_column : 12
    <22a>   DW_AT_type        : <0x7c>
    <22e>   DW_AT_data_member_location: 20
 <2><22f>: Abbrev Number: 1 (DW_TAG_member)
    <230>   DW_AT_name        : (indirect string, offset: 0x6d729): LSIState
    <234>   DW_AT_decl_file   : 8
    <235>   DW_AT_decl_line   : 251
    <236>   DW_AT_decl_column : 12
    <236>   DW_AT_type        : <0x7c>
    <23a>   DW_AT_data_member_location: 24
 <2><23b>: Abbrev Number: 18 (DW_TAG_member)
    <23c>   DW_AT_name        : PLL
    <240>   DW_AT_decl_file   : 8
    <241>   DW_AT_decl_line   : 254
    <242>   DW_AT_decl_column : 22
    <243>   DW_AT_type        : <0x182>
    <247>   DW_AT_data_member_location: 28
 <2><248>: Abbrev Number: 0
 <1><249>: Abbrev Number: 10 (DW_TAG_typedef)
    <24a>   DW_AT_name        : (indirect string, offset: 0x41392): RCC_OscInitTypeDef
    <24e>   DW_AT_decl_file   : 8
    <24f>   DW_AT_decl_line   : 259
    <251>   DW_AT_decl_column : 3
    <251>   DW_AT_type        : <0x1df>
 <1><255>: Abbrev Number: 11 (DW_TAG_subprogram)
    <256>   DW_AT_external    : 1
    <256>   DW_AT_name        : (indirect string, offset: 0x69457): HAL_RCC_ClockConfig
    <25a>   DW_AT_decl_file   : 7
    <25a>   DW_AT_decl_line   : 1156
    <25c>   DW_AT_decl_column : 19
    <25c>   DW_AT_prototyped  : 1
    <25c>   DW_AT_type        : <0x149>
    <260>   DW_AT_declaration : 1
    <260>   DW_AT_sibling     : <0x26f>
 <2><264>: Abbrev Number: 8 (DW_TAG_formal_parameter)
    <265>   DW_AT_type        : <0x26f>
 <2><269>: Abbrev Number: 8 (DW_TAG_formal_parameter)
    <26a>   DW_AT_type        : <0x7c>
 <2><26e>: Abbrev Number: 0
 <1><26f>: Abbrev Number: 12 (DW_TAG_pointer_type)
    <270>   DW_AT_byte_size   : 4
    <270>   DW_AT_type        : <0x1d3>
 <1><274>: Abbrev Number: 11 (DW_TAG_subprogram)
    <275>   DW_AT_external    : 1
    <275>   DW_AT_name        : (indirect string, offset: 0x55140): HAL_RCC_OscConfig
    <279>   DW_AT_decl_file   : 7
    <279>   DW_AT_decl_line   : 1155
    <27b>   DW_AT_decl_column : 19
    <27b>   DW_AT_prototyped  : 1
    <27b>   DW_AT_type        : <0x149>
    <27f>   DW_AT_declaration : 1
    <27f>   DW_AT_sibling     : <0x289>
 <2><283>: Abbrev Number: 8 (DW_TAG_formal_parameter)
    <284>   DW_AT_type        : <0x289>
 <2><288>: Abbrev Number: 0
 <1><289>: Abbrev Number: 12 (DW_TAG_pointer_type)
    <28a>   DW_AT_byte_size   : 4
    <28a>   DW_AT_type        : <0x249>
 <1><28e>: Abbrev Number: 19 (DW_TAG_subprogram)
    <28f>   DW_AT_external    : 1
    <28f>   DW_AT_name        : (indirect string, offset: 0x7264d): HAL_Init
    <293>   DW_AT_decl_file   : 9
    <294>   DW_AT_decl_line   : 282
    <296>   DW_AT_decl_column : 19
    <297>   DW_AT_prototyped  : 1
    <297>   DW_AT_type        : <0x149>
    <29b>   DW_AT_declaration : 1
 <1><29b>: Abbrev Number: 20 (DW_TAG_subprogram)
    <29c>   DW_AT_external    : 1
    <29c>   DW_AT_name        : (indirect string, offset: 0x36b17): Error_Handler
    <2a0>   DW_AT_decl_file   : 1
    <2a1>   DW_AT_decl_line   : 164
    <2a2>   DW_AT_decl_column : 6
    <2a3>   DW_AT_prototyped  : 1
    <2a3>   DW_AT_low_pc      : 0x8000200
    <2a7>   DW_AT_high_pc     : 0xa
    <2ab>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <2ad>   DW_AT_call_all_calls: 1
    <2ad>   DW_AT_sibling     : <0x2c2>
 <2><2b1>: Abbrev Number: 21 (DW_TAG_inlined_subroutine)
    <2b2>   DW_AT_abstract_origin: <0x33b>
    <2b6>   DW_AT_low_pc      : 0x8000204
    <2ba>   DW_AT_high_pc     : 0x4
    <2be>   DW_AT_call_file   : 1
    <2bf>   DW_AT_call_line   : 168
    <2c0>   DW_AT_call_column : 3
 <2><2c1>: Abbrev Number: 0
 <1><2c2>: Abbrev Number: 22 (DW_TAG_subprogram)
    <2c3>   DW_AT_name        : (indirect string, offset: 0x32438): MX_GPIO_Init
    <2c7>   DW_AT_decl_file   : 1
    <2c8>   DW_AT_decl_line   : 144
    <2c9>   DW_AT_decl_column : 13
    <2ca>   DW_AT_prototyped  : 1
    <2ca>   DW_AT_low_pc      : 0x80001d4
    <2ce>   DW_AT_high_pc     : 0x2c
    <2d2>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <2d4>   DW_AT_call_all_calls: 1
    <2d4>   DW_AT_sibling     : <0x2f1>
 <2><2d8>: Abbrev Number: 23 (DW_TAG_lexical_block)
    <2d9>   DW_AT_low_pc      : 0x80001da
    <2dd>   DW_AT_high_pc     : 0x18
 <3><2e1>: Abbrev Number: 9 (DW_TAG_variable)
    <2e2>   DW_AT_name        : (indirect string, offset: 0xcf6): tmpreg
    <2e6>   DW_AT_decl_file   : 1
    <2e6>   DW_AT_decl_line   : 150
    <2e7>   DW_AT_decl_column : 3
    <2e8>   DW_AT_type        : <0x88>
    <2ec>   DW_AT_location    : 2 byte block: 91 74 	(DW_OP_fbreg: -12)
 <3><2ef>: Abbrev Number: 0
 <2><2f0>: Abbrev Number: 0
 <1><2f1>: Abbrev Number: 24 (DW_TAG_subprogram)
    <2f2>   DW_AT_external    : 1
    <2f2>   DW_AT_name        : (indirect string, offset: 0x553d6): SystemClock_Config
    <2f6>   DW_AT_decl_file   : 1
    <2f7>   DW_AT_decl_line   : 107
    <2f8>   DW_AT_decl_column : 6
    <2f9>   DW_AT_prototyped  : 1
    <2f9>   DW_AT_low_pc      : 0x800015e
    <2fd>   DW_AT_high_pc     : 0x76
    <301>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <303>   DW_AT_call_all_tail_calls: 1
    <303>   DW_AT_sibling     : <0x325>
 <2><307>: Abbrev Number: 9 (DW_TAG_variable)
    <308>   DW_AT_name        : (indirect string, offset: 0x1ab23): RCC_OscInitStruct
    <30c>   DW_AT_decl_file   : 1
    <30c>   DW_AT_decl_line   : 109
    <30d>   DW_AT_decl_column : 22
    <30e>   DW_AT_type        : <0x249>
    <312>   DW_AT_location    : 2 byte block: 91 50 	(DW_OP_fbreg: -48)
 <2><315>: Abbrev Number: 9 (DW_TAG_variable)
    <316>   DW_AT_name        : (indirect string, offset: 0x2e560): RCC_ClkInitStruct
    <31a>   DW_AT_decl_file   : 1
    <31a>   DW_AT_decl_line   : 110
    <31b>   DW_AT_decl_column : 22
    <31c>   DW_AT_type        : <0x1d3>
    <320>   DW_AT_location    : 3 byte block: 91 bc 7f 	(DW_OP_fbreg: -68)
 <2><324>: Abbrev Number: 0
 <1><325>: Abbrev Number: 25 (DW_TAG_subprogram)
    <326>   DW_AT_external    : 1
    <326>   DW_AT_name        : (indirect string, offset: 0xc71b): main
    <32a>   DW_AT_decl_file   : 1
    <32b>   DW_AT_decl_line   : 64
    <32c>   DW_AT_decl_column : 5
    <32d>   DW_AT_prototyped  : 1
    <32d>   DW_AT_type        : <0x6e>
    <331>   DW_AT_low_pc      : 0x800014c
    <335>   DW_AT_high_pc     : 0x12
    <339>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <33b>   DW_AT_call_all_tail_calls: 1
 <1><33b>: Abbrev Number: 26 (DW_TAG_subprogram)
    <33c>   DW_AT_name        : (indirect string, offset: 0x43a67): __disable_irq
    <340>   DW_AT_decl_file   : 2
    <341>   DW_AT_decl_line   : 140
    <342>   DW_AT_decl_column : 27
    <343>   DW_AT_prototyped  : 1
    <343>   DW_AT_inline      : 3	(declared as inline and inlined)
 <1><344>: Abbrev Number: 0
  Compilation Unit @ offset 0x345:
   Length:        0x1ed (32-bit)
   Version:       5
   Unit Type:     DW_UT_compile (1)
   Abbrev Offset: 0x1bc
   Pointer Size:  4
 <0><351>: Abbrev Number: 10 (DW_TAG_compile_unit)
    <352>   DW_AT_producer    : (indirect string, offset: 0x4ec7b): GNU C11 11.3.1 20220712 -mcpu=cortex-m3 -mfloat-abi=soft -mthumb -march=armv7-m -g3 -O0 -std=gnu11 -ffunction-sections -fdata-sections -fstack-usage -fcyclomatic-complexity
    <356>   DW_AT_language    : 29	(C11)
    <357>   DW_AT_name        : (indirect string, offset: 0x7aaa2): ../Core/Src/stm32f1xx_hal_msp.c
    <35b>   DW_AT_comp_dir    : (indirect string, offset: 0x123a4): F:/HEATER SYSTEM PID/CODE/Debug
    <35f>   DW_AT_ranges      : 0x31
    <363>   DW_AT_low_pc      : 0x0
    <367>   DW_AT_stmt_list   : 0x72f
    <36b>   DW_AT_macros      : 0x14d9c
 <1><36f>: Abbrev Number: 2 (DW_TAG_base_type)
    <370>   DW_AT_byte_size   : 1
    <371>   DW_AT_encoding    : 6	(signed char)
    <372>   DW_AT_name        : (indirect string, offset: 0x3d7e9): signed char
 <1><376>: Abbrev Number: 2 (DW_TAG_base_type)
    <377>   DW_AT_byte_size   : 1
    <378>   DW_AT_encoding    : 8	(unsigned char)
    <379>   DW_AT_name        : (indirect string, offset: 0x19162): unsigned char
 <1><37d>: Abbrev Number: 2 (DW_TAG_base_type)
    <37e>   DW_AT_byte_size   : 2
    <37f>   DW_AT_encoding    : 5	(signed)
    <380>   DW_AT_name        : (indirect string, offset: 0x5b395): short int
 <1><384>: Abbrev Number: 2 (DW_TAG_base_type)
    <385>   DW_AT_byte_size   : 2
    <386>   DW_AT_encoding    : 7	(unsigned)
    <387>   DW_AT_name        : (indirect string, offset: 0x28427): short unsigned int
 <1><38b>: Abbrev Number: 2 (DW_TAG_base_type)
    <38c>   DW_AT_byte_size   : 4
    <38d>   DW_AT_encoding    : 5	(signed)
    <38e>   DW_AT_name        : (indirect string, offset: 0xab4c): long int
 <1><392>: Abbrev Number: 5 (DW_TAG_typedef)
    <393>   DW_AT_name        : (indirect string, offset: 0x4dfcc): __uint32_t
    <397>   DW_AT_decl_file   : 2
    <398>   DW_AT_decl_line   : 79
    <399>   DW_AT_decl_column : 25
    <39a>   DW_AT_type        : <0x39e>
 <1><39e>: Abbrev Number: 2 (DW_TAG_base_type)
    <39f>   DW_AT_byte_size   : 4
    <3a0>   DW_AT_encoding    : 7	(unsigned)
    <3a1>   DW_AT_name        : (indirect string, offset: 0x1cfc3): long unsigned int
 <1><3a5>: Abbrev Number: 2 (DW_TAG_base_type)
    <3a6>   DW_AT_byte_size   : 8
    <3a7>   DW_AT_encoding    : 5	(signed)
    <3a8>   DW_AT_name        : (indirect string, offset: 0x3861e): long long int
 <1><3ac>: Abbrev Number: 2 (DW_TAG_base_type)
    <3ad>   DW_AT_byte_size   : 8
    <3ae>   DW_AT_encoding    : 7	(unsigned)
    <3af>   DW_AT_name        : (indirect string, offset: 0x1981f): long long unsigned int
 <1><3b3>: Abbrev Number: 11 (DW_TAG_base_type)
    <3b4>   DW_AT_byte_size   : 4
    <3b5>   DW_AT_encoding    : 5	(signed)
    <3b6>   DW_AT_name        : int
 <1><3ba>: Abbrev Number: 2 (DW_TAG_base_type)
    <3bb>   DW_AT_byte_size   : 4
    <3bc>   DW_AT_encoding    : 7	(unsigned)
    <3bd>   DW_AT_name        : (indirect string, offset: 0xa50f): unsigned int
 <1><3c1>: Abbrev Number: 5 (DW_TAG_typedef)
    <3c2>   DW_AT_name        : (indirect string, offset: 0x4dfce): uint32_t
    <3c6>   DW_AT_decl_file   : 3
    <3c7>   DW_AT_decl_line   : 48
    <3c8>   DW_AT_decl_column : 20
    <3c9>   DW_AT_type        : <0x392>
 <1><3cd>: Abbrev Number: 6 (DW_TAG_volatile_type)
    <3ce>   DW_AT_type        : <0x3c1>
 <1><3d2>: Abbrev Number: 7 (DW_TAG_structure_type)
    <3d3>   DW_AT_byte_size   : 32
    <3d4>   DW_AT_decl_file   : 4
    <3d4>   DW_AT_decl_line   : 372
    <3d6>   DW_AT_decl_column : 9
    <3d6>   DW_AT_sibling     : <0x41c>
 <2><3da>: Abbrev Number: 1 (DW_TAG_member)
    <3db>   DW_AT_name        : (indirect string, offset: 0x7aac2): EVCR
    <3df>   DW_AT_decl_file   : 4
    <3df>   DW_AT_decl_line   : 374
    <3e1>   DW_AT_decl_column : 17
    <3e2>   DW_AT_type        : <0x3cd>
    <3e6>   DW_AT_data_member_location: 0
 <2><3e7>: Abbrev Number: 1 (DW_TAG_member)
    <3e8>   DW_AT_name        : (indirect string, offset: 0x7aad1): MAPR
    <3ec>   DW_AT_decl_file   : 4
    <3ec>   DW_AT_decl_line   : 375
    <3ee>   DW_AT_decl_column : 17
    <3ef>   DW_AT_type        : <0x3cd>
    <3f3>   DW_AT_data_member_location: 4
 <2><3f4>: Abbrev Number: 1 (DW_TAG_member)
    <3f5>   DW_AT_name        : (indirect string, offset: 0x7aa9b): EXTICR
    <3f9>   DW_AT_decl_file   : 4
    <3f9>   DW_AT_decl_line   : 376
    <3fb>   DW_AT_decl_column : 17
    <3fc>   DW_AT_type        : <0x42c>
    <400>   DW_AT_data_member_location: 8
 <2><401>: Abbrev Number: 1 (DW_TAG_member)
    <402>   DW_AT_name        : (indirect string, offset: 0x7aac7): RESERVED0
    <406>   DW_AT_decl_file   : 4
    <406>   DW_AT_decl_line   : 377
    <408>   DW_AT_decl_column : 12
    <409>   DW_AT_type        : <0x3c1>
    <40d>   DW_AT_data_member_location: 24
 <2><40e>: Abbrev Number: 1 (DW_TAG_member)
    <40f>   DW_AT_name        : (indirect string, offset: 0x7aa88): MAPR2
    <413>   DW_AT_decl_file   : 4
    <413>   DW_AT_decl_line   : 378
    <415>   DW_AT_decl_column : 17
    <416>   DW_AT_type        : <0x3cd>
    <41a>   DW_AT_data_member_location: 28
 <2><41b>: Abbrev Number: 0
 <1><41c>: Abbrev Number: 12 (DW_TAG_array_type)
    <41d>   DW_AT_type        : <0x3cd>
    <421>   DW_AT_sibling     : <0x42c>
 <2><425>: Abbrev Number: 13 (DW_TAG_subrange_type)
    <426>   DW_AT_type        : <0x3ba>
    <42a>   DW_AT_upper_bound : 3
 <2><42b>: Abbrev Number: 0
 <1><42c>: Abbrev Number: 6 (DW_TAG_volatile_type)
    <42d>   DW_AT_type        : <0x41c>
 <1><431>: Abbrev Number: 8 (DW_TAG_typedef)
    <432>   DW_AT_name        : (indirect string, offset: 0x7aa8e): AFIO_TypeDef
    <436>   DW_AT_decl_file   : 4
    <436>   DW_AT_decl_line   : 379
    <438>   DW_AT_decl_column : 3
    <438>   DW_AT_type        : <0x3d2>
 <1><43c>: Abbrev Number: 7 (DW_TAG_structure_type)
    <43d>   DW_AT_byte_size   : 40
    <43e>   DW_AT_decl_file   : 4
    <43e>   DW_AT_decl_line   : 423
    <440>   DW_AT_decl_column : 9
    <440>   DW_AT_sibling     : <0x4c3>
 <2><444>: Abbrev Number: 3 (DW_TAG_member)
    <445>   DW_AT_name        : CR
    <448>   DW_AT_decl_file   : 4
    <448>   DW_AT_decl_line   : 425
    <44a>   DW_AT_decl_column : 17
    <44a>   DW_AT_type        : <0x3cd>
    <44e>   DW_AT_data_member_location: 0
 <2><44f>: Abbrev Number: 1 (DW_TAG_member)
    <450>   DW_AT_name        : (indirect string, offset: 0x4a7a2): CFGR
    <454>   DW_AT_decl_file   : 4
    <454>   DW_AT_decl_line   : 426
    <456>   DW_AT_decl_column : 17
    <457>   DW_AT_type        : <0x3cd>
    <45b>   DW_AT_data_member_location: 4
 <2><45c>: Abbrev Number: 3 (DW_TAG_member)
    <45d>   DW_AT_name        : CIR
    <461>   DW_AT_decl_file   : 4
    <461>   DW_AT_decl_line   : 427
    <463>   DW_AT_decl_column : 17
    <463>   DW_AT_type        : <0x3cd>
    <467>   DW_AT_data_member_location: 8
 <2><468>: Abbrev Number: 1 (DW_TAG_member)
    <469>   DW_AT_name        : (indirect string, offset: 0x359c9): APB2RSTR
    <46d>   DW_AT_decl_file   : 4
    <46d>   DW_AT_decl_line   : 428
    <46f>   DW_AT_decl_column : 17
    <470>   DW_AT_type        : <0x3cd>
    <474>   DW_AT_data_member_location: 12
 <2><475>: Abbrev Number: 1 (DW_TAG_member)
    <476>   DW_AT_name        : (indirect string, offset: 0xe117): APB1RSTR
    <47a>   DW_AT_decl_file   : 4
    <47a>   DW_AT_decl_line   : 429
    <47c>   DW_AT_decl_column : 17
    <47d>   DW_AT_type        : <0x3cd>
    <481>   DW_AT_data_member_location: 16
 <2><482>: Abbrev Number: 1 (DW_TAG_member)
    <483>   DW_AT_name        : (indirect string, offset: 0xb8d0): AHBENR
    <487>   DW_AT_decl_file   : 4
    <487>   DW_AT_decl_line   : 430
    <489>   DW_AT_decl_column : 17
    <48a>   DW_AT_type        : <0x3cd>
    <48e>   DW_AT_data_member_location: 20
 <2><48f>: Abbrev Number: 1 (DW_TAG_member)
    <490>   DW_AT_name        : (indirect string, offset: 0xeaaf): APB2ENR
    <494>   DW_AT_decl_file   : 4
    <494>   DW_AT_decl_line   : 431
    <496>   DW_AT_decl_column : 17
    <497>   DW_AT_type        : <0x3cd>
    <49b>   DW_AT_data_member_location: 24
 <2><49c>: Abbrev Number: 1 (DW_TAG_member)
    <49d>   DW_AT_name        : (indirect string, offset: 0x5c28a): APB1ENR
    <4a1>   DW_AT_decl_file   : 4
    <4a1>   DW_AT_decl_line   : 432
    <4a3>   DW_AT_decl_column : 17
    <4a4>   DW_AT_type        : <0x3cd>
    <4a8>   DW_AT_data_member_location: 28
 <2><4a9>: Abbrev Number: 1 (DW_TAG_member)
    <4aa>   DW_AT_name        : (indirect string, offset: 0x110af): BDCR
    <4ae>   DW_AT_decl_file   : 4
    <4ae>   DW_AT_decl_line   : 433
    <4b0>   DW_AT_decl_column : 17
    <4b1>   DW_AT_type        : <0x3cd>
    <4b5>   DW_AT_data_member_location: 32
 <2><4b6>: Abbrev Number: 3 (DW_TAG_member)
    <4b7>   DW_AT_name        : CSR
    <4bb>   DW_AT_decl_file   : 4
    <4bb>   DW_AT_decl_line   : 434
    <4bd>   DW_AT_decl_column : 17
    <4bd>   DW_AT_type        : <0x3cd>
    <4c1>   DW_AT_data_member_location: 36
 <2><4c2>: Abbrev Number: 0
 <1><4c3>: Abbrev Number: 8 (DW_TAG_typedef)
    <4c4>   DW_AT_name        : (indirect string, offset: 0x393c4): RCC_TypeDef
    <4c8>   DW_AT_decl_file   : 4
    <4c8>   DW_AT_decl_line   : 437
    <4ca>   DW_AT_decl_column : 3
    <4ca>   DW_AT_type        : <0x43c>
 <1><4ce>: Abbrev Number: 2 (DW_TAG_base_type)
    <4cf>   DW_AT_byte_size   : 8
    <4d0>   DW_AT_encoding    : 4	(float)
    <4d1>   DW_AT_name        : (indirect string, offset: 0x1380f): long double
 <1><4d5>: Abbrev Number: 14 (DW_TAG_subprogram)
    <4d6>   DW_AT_external    : 1
    <4d6>   DW_AT_name        : (indirect string, offset: 0x7aad6): HAL_MspInit
    <4da>   DW_AT_decl_file   : 1
    <4db>   DW_AT_decl_line   : 64
    <4dc>   DW_AT_decl_column : 6
    <4dd>   DW_AT_prototyped  : 1
    <4dd>   DW_AT_low_pc      : 0x800020c
    <4e1>   DW_AT_high_pc     : 0x64
    <4e5>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <4e7>   DW_AT_call_all_calls: 1
 <2><4e7>: Abbrev Number: 9 (DW_TAG_lexical_block)
    <4e8>   DW_AT_low_pc      : 0x8000212
    <4ec>   DW_AT_high_pc     : 0x18
    <4f0>   DW_AT_sibling     : <0x502>
 <3><4f4>: Abbrev Number: 4 (DW_TAG_variable)
    <4f5>   DW_AT_name        : (indirect string, offset: 0xcf6): tmpreg
    <4f9>   DW_AT_decl_file   : 1
    <4f9>   DW_AT_decl_line   : 70
    <4fa>   DW_AT_decl_column : 3
    <4fa>   DW_AT_type        : <0x3cd>
    <4fe>   DW_AT_location    : 2 byte block: 91 70 	(DW_OP_fbreg: -16)
 <3><501>: Abbrev Number: 0
 <2><502>: Abbrev Number: 9 (DW_TAG_lexical_block)
    <503>   DW_AT_low_pc      : 0x800022a
    <507>   DW_AT_high_pc     : 0x18
    <50b>   DW_AT_sibling     : <0x51d>
 <3><50f>: Abbrev Number: 4 (DW_TAG_variable)
    <510>   DW_AT_name        : (indirect string, offset: 0xcf6): tmpreg
    <514>   DW_AT_decl_file   : 1
    <514>   DW_AT_decl_line   : 71
    <515>   DW_AT_decl_column : 3
    <515>   DW_AT_type        : <0x3cd>
    <519>   DW_AT_location    : 2 byte block: 91 6c 	(DW_OP_fbreg: -20)
 <3><51c>: Abbrev Number: 0
 <2><51d>: Abbrev Number: 15 (DW_TAG_lexical_block)
    <51e>   DW_AT_low_pc      : 0x8000242
    <522>   DW_AT_high_pc     : 0x1c
 <3><526>: Abbrev Number: 4 (DW_TAG_variable)
    <527>   DW_AT_name        : (indirect string, offset: 0xcf6): tmpreg
    <52b>   DW_AT_decl_file   : 1
    <52b>   DW_AT_decl_line   : 77
    <52c>   DW_AT_decl_column : 3
    <52c>   DW_AT_type        : <0x3c1>
    <530>   DW_AT_location    : 2 byte block: 91 74 	(DW_OP_fbreg: -12)
 <3><533>: Abbrev Number: 0
 <2><534>: Abbrev Number: 0
 <1><535>: Abbrev Number: 0
  Compilation Unit @ offset 0x536:
   Length:        0x10f (32-bit)
   Version:       5
   Unit Type:     DW_UT_compile (1)
   Abbrev Offset: 0x297
   Pointer Size:  4
 <0><542>: Abbrev Number: 3 (DW_TAG_compile_unit)
    <543>   DW_AT_producer    : (indirect string, offset: 0x4ec7b): GNU C11 11.3.1 20220712 -mcpu=cortex-m3 -mfloat-abi=soft -mthumb -march=armv7-m -g3 -O0 -std=gnu11 -ffunction-sections -fdata-sections -fstack-usage -fcyclomatic-complexity
    <547>   DW_AT_language    : 29	(C11)
    <548>   DW_AT_name        : (indirect string, offset: 0x7ab90): ../Core/Src/stm32f1xx_it.c
    <54c>   DW_AT_comp_dir    : (indirect string, offset: 0x123a4): F:/HEATER SYSTEM PID/CODE/Debug
    <550>   DW_AT_ranges      : 0x44
    <554>   DW_AT_low_pc      : 0x0
    <558>   DW_AT_stmt_list   : 0xde4
    <55c>   DW_AT_macros      : 0x14f2a
 <1><560>: Abbrev Number: 1 (DW_TAG_base_type)
    <561>   DW_AT_byte_size   : 1
    <562>   DW_AT_encoding    : 6	(signed char)
    <563>   DW_AT_name        : (indirect string, offset: 0x3d7e9): signed char
 <1><567>: Abbrev Number: 1 (DW_TAG_base_type)
    <568>   DW_AT_byte_size   : 1
    <569>   DW_AT_encoding    : 8	(unsigned char)
    <56a>   DW_AT_name        : (indirect string, offset: 0x19162): unsigned char
 <1><56e>: Abbrev Number: 1 (DW_TAG_base_type)
    <56f>   DW_AT_byte_size   : 2
    <570>   DW_AT_encoding    : 5	(signed)
    <571>   DW_AT_name        : (indirect string, offset: 0x5b395): short int
 <1><575>: Abbrev Number: 1 (DW_TAG_base_type)
    <576>   DW_AT_byte_size   : 2
    <577>   DW_AT_encoding    : 7	(unsigned)
    <578>   DW_AT_name        : (indirect string, offset: 0x28427): short unsigned int
 <1><57c>: Abbrev Number: 1 (DW_TAG_base_type)
    <57d>   DW_AT_byte_size   : 4
    <57e>   DW_AT_encoding    : 5	(signed)
    <57f>   DW_AT_name        : (indirect string, offset: 0xab4c): long int
 <1><583>: Abbrev Number: 1 (DW_TAG_base_type)
    <584>   DW_AT_byte_size   : 4
    <585>   DW_AT_encoding    : 7	(unsigned)
    <586>   DW_AT_name        : (indirect string, offset: 0x1cfc3): long unsigned int
 <1><58a>: Abbrev Number: 1 (DW_TAG_base_type)
    <58b>   DW_AT_byte_size   : 8
    <58c>   DW_AT_encoding    : 5	(signed)
    <58d>   DW_AT_name        : (indirect string, offset: 0x3861e): long long int
 <1><591>: Abbrev Number: 1 (DW_TAG_base_type)
    <592>   DW_AT_byte_size   : 8
    <593>   DW_AT_encoding    : 7	(unsigned)
    <594>   DW_AT_name        : (indirect string, offset: 0x1981f): long long unsigned int
 <1><598>: Abbrev Number: 4 (DW_TAG_base_type)
    <599>   DW_AT_byte_size   : 4
    <59a>   DW_AT_encoding    : 5	(signed)
    <59b>   DW_AT_name        : int
 <1><59f>: Abbrev Number: 1 (DW_TAG_base_type)
    <5a0>   DW_AT_byte_size   : 4
    <5a1>   DW_AT_encoding    : 7	(unsigned)
    <5a2>   DW_AT_name        : (indirect string, offset: 0xa50f): unsigned int
 <1><5a6>: Abbrev Number: 1 (DW_TAG_base_type)
    <5a7>   DW_AT_byte_size   : 8
    <5a8>   DW_AT_encoding    : 4	(float)
    <5a9>   DW_AT_name        : (indirect string, offset: 0x1380f): long double
 <1><5ad>: Abbrev Number: 5 (DW_TAG_subprogram)
    <5ae>   DW_AT_external    : 1
    <5ae>   DW_AT_name        : (indirect string, offset: 0x7ab63): HAL_IncTick
    <5b2>   DW_AT_decl_file   : 2
    <5b3>   DW_AT_decl_line   : 295
    <5b5>   DW_AT_decl_column : 6
    <5b6>   DW_AT_prototyped  : 1
    <5b6>   DW_AT_declaration : 1
 <1><5b6>: Abbrev Number: 6 (DW_TAG_subprogram)
    <5b7>   DW_AT_external    : 1
    <5b7>   DW_AT_name        : (indirect string, offset: 0x7ab80): SysTick_Handler
    <5bb>   DW_AT_decl_file   : 1
    <5bc>   DW_AT_decl_line   : 183
    <5bd>   DW_AT_decl_column : 6
    <5be>   DW_AT_prototyped  : 1
    <5be>   DW_AT_low_pc      : 0x80002b2
    <5c2>   DW_AT_high_pc     : 0xc
    <5c6>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <5c8>   DW_AT_call_all_tail_calls: 1
 <1><5c8>: Abbrev Number: 2 (DW_TAG_subprogram)
    <5c9>   DW_AT_external    : 1
    <5c9>   DW_AT_name        : (indirect string, offset: 0x7ab42): PendSV_Handler
    <5cd>   DW_AT_decl_file   : 1
    <5cd>   DW_AT_decl_line   : 170
    <5ce>   DW_AT_decl_column : 6
    <5ce>   DW_AT_prototyped  : 1
    <5ce>   DW_AT_low_pc      : 0x80002a6
    <5d2>   DW_AT_high_pc     : 0xc
    <5d6>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <5d8>   DW_AT_call_all_calls: 1
 <1><5d8>: Abbrev Number: 2 (DW_TAG_subprogram)
    <5d9>   DW_AT_external    : 1
    <5d9>   DW_AT_name        : (indirect string, offset: 0x7ab31): DebugMon_Handler
    <5dd>   DW_AT_decl_file   : 1
    <5dd>   DW_AT_decl_line   : 157
    <5de>   DW_AT_decl_column : 6
    <5de>   DW_AT_prototyped  : 1
    <5de>   DW_AT_low_pc      : 0x800029a
    <5e2>   DW_AT_high_pc     : 0xc
    <5e6>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <5e8>   DW_AT_call_all_calls: 1
 <1><5e8>: Abbrev Number: 2 (DW_TAG_subprogram)
    <5e9>   DW_AT_external    : 1
    <5e9>   DW_AT_name        : (indirect string, offset: 0x7ab25): SVC_Handler
    <5ed>   DW_AT_decl_file   : 1
    <5ed>   DW_AT_decl_line   : 144
    <5ee>   DW_AT_decl_column : 6
    <5ee>   DW_AT_prototyped  : 1
    <5ee>   DW_AT_low_pc      : 0x800028e
    <5f2>   DW_AT_high_pc     : 0xc
    <5f6>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <5f8>   DW_AT_call_all_calls: 1
 <1><5f8>: Abbrev Number: 2 (DW_TAG_subprogram)
    <5f9>   DW_AT_external    : 1
    <5f9>   DW_AT_name        : (indirect string, offset: 0x7aae2): UsageFault_Handler
    <5fd>   DW_AT_decl_file   : 1
    <5fd>   DW_AT_decl_line   : 129
    <5fe>   DW_AT_decl_column : 6
    <5fe>   DW_AT_prototyped  : 1
    <5fe>   DW_AT_low_pc      : 0x8000288
    <602>   DW_AT_high_pc     : 0x6
    <606>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <608>   DW_AT_call_all_calls: 1
 <1><608>: Abbrev Number: 2 (DW_TAG_subprogram)
    <609>   DW_AT_external    : 1
    <609>   DW_AT_name        : (indirect string, offset: 0x7ab6f): BusFault_Handler
    <60d>   DW_AT_decl_file   : 1
    <60d>   DW_AT_decl_line   : 114
    <60e>   DW_AT_decl_column : 6
    <60e>   DW_AT_prototyped  : 1
    <60e>   DW_AT_low_pc      : 0x8000282
    <612>   DW_AT_high_pc     : 0x6
    <616>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <618>   DW_AT_call_all_calls: 1
 <1><618>: Abbrev Number: 2 (DW_TAG_subprogram)
    <619>   DW_AT_external    : 1
    <619>   DW_AT_name        : (indirect string, offset: 0x7ab51): MemManage_Handler
    <61d>   DW_AT_decl_file   : 1
    <61d>   DW_AT_decl_line   : 99
    <61e>   DW_AT_decl_column : 6
    <61e>   DW_AT_prototyped  : 1
    <61e>   DW_AT_low_pc      : 0x800027c
    <622>   DW_AT_high_pc     : 0x6
    <626>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <628>   DW_AT_call_all_calls: 1
 <1><628>: Abbrev Number: 2 (DW_TAG_subprogram)
    <629>   DW_AT_external    : 1
    <629>   DW_AT_name        : (indirect string, offset: 0x7ab07): HardFault_Handler
    <62d>   DW_AT_decl_file   : 1
    <62d>   DW_AT_decl_line   : 84
    <62e>   DW_AT_decl_column : 6
    <62e>   DW_AT_prototyped  : 1
    <62e>   DW_AT_low_pc      : 0x8000276
    <632>   DW_AT_high_pc     : 0x6
    <636>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <638>   DW_AT_call_all_calls: 1
 <1><638>: Abbrev Number: 2 (DW_TAG_subprogram)
    <639>   DW_AT_external    : 1
    <639>   DW_AT_name        : (indirect string, offset: 0x7ab19): NMI_Handler
    <63d>   DW_AT_decl_file   : 1
    <63d>   DW_AT_decl_line   : 69
    <63e>   DW_AT_decl_column : 6
    <63e>   DW_AT_prototyped  : 1
    <63e>   DW_AT_low_pc      : 0x8000270
    <642>   DW_AT_high_pc     : 0x6
    <646>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <648>   DW_AT_call_all_calls: 1
 <1><648>: Abbrev Number: 0
  Compilation Unit @ offset 0x649:
   Length:        0x21e (32-bit)
   Version:       5
   Unit Type:     DW_UT_compile (1)
   Abbrev Offset: 0x30a
   Pointer Size:  4
 <0><655>: Abbrev Number: 11 (DW_TAG_compile_unit)
    <656>   DW_AT_producer    : (indirect string, offset: 0x4ec7b): GNU C11 11.3.1 20220712 -mcpu=cortex-m3 -mfloat-abi=soft -mthumb -march=armv7-m -g3 -O0 -std=gnu11 -ffunction-sections -fdata-sections -fstack-usage -fcyclomatic-complexity
    <65a>   DW_AT_language    : 29	(C11)
    <65b>   DW_AT_name        : (indirect string, offset: 0x7abd8): ../Core/Src/system_stm32f1xx.c
    <65f>   DW_AT_comp_dir    : (indirect string, offset: 0x123a4): F:/HEATER SYSTEM PID/CODE/Debug
    <663>   DW_AT_ranges      : 0x87
    <667>   DW_AT_low_pc      : 0x0
    <66b>   DW_AT_stmt_list   : 0x155a
    <66f>   DW_AT_macros      : 0x150c2
 <1><673>: Abbrev Number: 1 (DW_TAG_base_type)
    <674>   DW_AT_byte_size   : 1
    <675>   DW_AT_encoding    : 6	(signed char)
    <676>   DW_AT_name        : (indirect string, offset: 0x3d7e9): signed char
 <1><67a>: Abbrev Number: 3 (DW_TAG_typedef)
    <67b>   DW_AT_name        : (indirect string, offset: 0x7abab): __uint8_t
    <67f>   DW_AT_decl_file   : 2
    <680>   DW_AT_decl_line   : 43
    <681>   DW_AT_decl_column : 24
    <682>   DW_AT_type        : <0x686>
 <1><686>: Abbrev Number: 1 (DW_TAG_base_type)
    <687>   DW_AT_byte_size   : 1
    <688>   DW_AT_encoding    : 8	(unsigned char)
    <689>   DW_AT_name        : (indirect string, offset: 0x19162): unsigned char
 <1><68d>: Abbrev Number: 1 (DW_TAG_base_type)
    <68e>   DW_AT_byte_size   : 2
    <68f>   DW_AT_encoding    : 5	(signed)
    <690>   DW_AT_name        : (indirect string, offset: 0x5b395): short int
 <1><694>: Abbrev Number: 1 (DW_TAG_base_type)
    <695>   DW_AT_byte_size   : 2
    <696>   DW_AT_encoding    : 7	(unsigned)
    <697>   DW_AT_name        : (indirect string, offset: 0x28427): short unsigned int
 <1><69b>: Abbrev Number: 1 (DW_TAG_base_type)
    <69c>   DW_AT_byte_size   : 4
    <69d>   DW_AT_encoding    : 5	(signed)
    <69e>   DW_AT_name        : (indirect string, offset: 0xab4c): long int
 <1><6a2>: Abbrev Number: 3 (DW_TAG_typedef)
    <6a3>   DW_AT_name        : (indirect string, offset: 0x4dfcc): __uint32_t
    <6a7>   DW_AT_decl_file   : 2
    <6a8>   DW_AT_decl_line   : 79
    <6a9>   DW_AT_decl_column : 25
    <6aa>   DW_AT_type        : <0x6ae>
 <1><6ae>: Abbrev Number: 1 (DW_TAG_base_type)
    <6af>   DW_AT_byte_size   : 4
    <6b0>   DW_AT_encoding    : 7	(unsigned)
    <6b1>   DW_AT_name        : (indirect string, offset: 0x1cfc3): long unsigned int
 <1><6b5>: Abbrev Number: 1 (DW_TAG_base_type)
    <6b6>   DW_AT_byte_size   : 8
    <6b7>   DW_AT_encoding    : 5	(signed)
    <6b8>   DW_AT_name        : (indirect string, offset: 0x3861e): long long int
 <1><6bc>: Abbrev Number: 1 (DW_TAG_base_type)
    <6bd>   DW_AT_byte_size   : 8
    <6be>   DW_AT_encoding    : 7	(unsigned)
    <6bf>   DW_AT_name        : (indirect string, offset: 0x1981f): long long unsigned int
 <1><6c3>: Abbrev Number: 12 (DW_TAG_base_type)
    <6c4>   DW_AT_byte_size   : 4
    <6c5>   DW_AT_encoding    : 5	(signed)
    <6c6>   DW_AT_name        : int
 <1><6ca>: Abbrev Number: 1 (DW_TAG_base_type)
    <6cb>   DW_AT_byte_size   : 4
    <6cc>   DW_AT_encoding    : 7	(unsigned)
    <6cd>   DW_AT_name        : (indirect string, offset: 0xa50f): unsigned int
 <1><6d1>: Abbrev Number: 3 (DW_TAG_typedef)
    <6d2>   DW_AT_name        : (indirect string, offset: 0x7abad): uint8_t
    <6d6>   DW_AT_decl_file   : 3
    <6d7>   DW_AT_decl_line   : 24
    <6d8>   DW_AT_decl_column : 19
    <6d9>   DW_AT_type        : <0x67a>
 <1><6dd>: Abbrev Number: 4 (DW_TAG_const_type)
    <6de>   DW_AT_type        : <0x6d1>
 <1><6e2>: Abbrev Number: 3 (DW_TAG_typedef)
    <6e3>   DW_AT_name        : (indirect string, offset: 0x4dfce): uint32_t
    <6e7>   DW_AT_decl_file   : 3
    <6e8>   DW_AT_decl_line   : 48
    <6e9>   DW_AT_decl_column : 20
    <6ea>   DW_AT_type        : <0x6a2>
 <1><6ee>: Abbrev Number: 13 (DW_TAG_volatile_type)
    <6ef>   DW_AT_type        : <0x6e2>
 <1><6f3>: Abbrev Number: 5 (DW_TAG_variable)
    <6f4>   DW_AT_name        : (indirect string, offset: 0x7ac15): SystemCoreClock
    <6f8>   DW_AT_decl_file   : 4
    <6f8>   DW_AT_decl_line   : 50
    <6f9>   DW_AT_decl_column : 17
    <6fa>   DW_AT_type        : <0x6e2>
    <6fe>   DW_AT_external    : 1
    <6fe>   DW_AT_declaration : 1
 <1><6fe>: Abbrev Number: 8 (DW_TAG_array_type)
    <6ff>   DW_AT_type        : <0x6dd>
    <703>   DW_AT_sibling     : <0x70e>
 <2><707>: Abbrev Number: 9 (DW_TAG_subrange_type)
    <708>   DW_AT_type        : <0x6ca>
    <70c>   DW_AT_upper_bound : 15
 <2><70d>: Abbrev Number: 0
 <1><70e>: Abbrev Number: 4 (DW_TAG_const_type)
    <70f>   DW_AT_type        : <0x6fe>
 <1><713>: Abbrev Number: 5 (DW_TAG_variable)
    <714>   DW_AT_name        : (indirect string, offset: 0x7abca): AHBPrescTable
    <718>   DW_AT_decl_file   : 4
    <718>   DW_AT_decl_line   : 51
    <719>   DW_AT_decl_column : 23
    <71a>   DW_AT_type        : <0x70e>
    <71e>   DW_AT_external    : 1
    <71e>   DW_AT_declaration : 1
 <1><71e>: Abbrev Number: 8 (DW_TAG_array_type)
    <71f>   DW_AT_type        : <0x6dd>
    <723>   DW_AT_sibling     : <0x72e>
 <2><727>: Abbrev Number: 9 (DW_TAG_subrange_type)
    <728>   DW_AT_type        : <0x6ca>
    <72c>   DW_AT_upper_bound : 7
 <2><72d>: Abbrev Number: 0
 <1><72e>: Abbrev Number: 4 (DW_TAG_const_type)
    <72f>   DW_AT_type        : <0x71e>
 <1><733>: Abbrev Number: 5 (DW_TAG_variable)
    <734>   DW_AT_name        : (indirect string, offset: 0x7ac25): APBPrescTable
    <738>   DW_AT_decl_file   : 4
    <738>   DW_AT_decl_line   : 52
    <739>   DW_AT_decl_column : 23
    <73a>   DW_AT_type        : <0x72e>
    <73e>   DW_AT_external    : 1
    <73e>   DW_AT_declaration : 1
 <1><73e>: Abbrev Number: 14 (DW_TAG_structure_type)
    <73f>   DW_AT_byte_size   : 40
    <740>   DW_AT_decl_file   : 5
    <741>   DW_AT_decl_line   : 423
    <743>   DW_AT_decl_column : 9
    <744>   DW_AT_sibling     : <0x7c0>
 <2><748>: Abbrev Number: 6 (DW_TAG_member)
    <749>   DW_AT_name        : CR
    <74c>   DW_AT_decl_file   : 5
    <74c>   DW_AT_decl_line   : 425
    <74e>   DW_AT_decl_column : 17
    <74e>   DW_AT_type        : <0x6ee>
    <752>   DW_AT_data_member_location: 0
 <2><753>: Abbrev Number: 2 (DW_TAG_member)
    <754>   DW_AT_name        : (indirect string, offset: 0x4a7a2): CFGR
    <758>   DW_AT_decl_file   : 5
    <758>   DW_AT_decl_line   : 426
    <75a>   DW_AT_decl_column : 17
    <75a>   DW_AT_type        : <0x6ee>
    <75e>   DW_AT_data_member_location: 4
 <2><75f>: Abbrev Number: 6 (DW_TAG_member)
    <760>   DW_AT_name        : CIR
    <764>   DW_AT_decl_file   : 5
    <764>   DW_AT_decl_line   : 427
    <766>   DW_AT_decl_column : 17
    <766>   DW_AT_type        : <0x6ee>
    <76a>   DW_AT_data_member_location: 8
 <2><76b>: Abbrev Number: 2 (DW_TAG_member)
    <76c>   DW_AT_name        : (indirect string, offset: 0x359c9): APB2RSTR
    <770>   DW_AT_decl_file   : 5
    <770>   DW_AT_decl_line   : 428
    <772>   DW_AT_decl_column : 17
    <772>   DW_AT_type        : <0x6ee>
    <776>   DW_AT_data_member_location: 12
 <2><777>: Abbrev Number: 2 (DW_TAG_member)
    <778>   DW_AT_name        : (indirect string, offset: 0xe117): APB1RSTR
    <77c>   DW_AT_decl_file   : 5
    <77c>   DW_AT_decl_line   : 429
    <77e>   DW_AT_decl_column : 17
    <77e>   DW_AT_type        : <0x6ee>
    <782>   DW_AT_data_member_location: 16
 <2><783>: Abbrev Number: 2 (DW_TAG_member)
    <784>   DW_AT_name        : (indirect string, offset: 0xb8d0): AHBENR
    <788>   DW_AT_decl_file   : 5
    <788>   DW_AT_decl_line   : 430
    <78a>   DW_AT_decl_column : 17
    <78a>   DW_AT_type        : <0x6ee>
    <78e>   DW_AT_data_member_location: 20
 <2><78f>: Abbrev Number: 2 (DW_TAG_member)
    <790>   DW_AT_name        : (indirect string, offset: 0xeaaf): APB2ENR
    <794>   DW_AT_decl_file   : 5
    <794>   DW_AT_decl_line   : 431
    <796>   DW_AT_decl_column : 17
    <796>   DW_AT_type        : <0x6ee>
    <79a>   DW_AT_data_member_location: 24
 <2><79b>: Abbrev Number: 2 (DW_TAG_member)
    <79c>   DW_AT_name        : (indirect string, offset: 0x5c28a): APB1ENR
    <7a0>   DW_AT_decl_file   : 5
    <7a0>   DW_AT_decl_line   : 432
    <7a2>   DW_AT_decl_column : 17
    <7a2>   DW_AT_type        : <0x6ee>
    <7a6>   DW_AT_data_member_location: 28
 <2><7a7>: Abbrev Number: 2 (DW_TAG_member)
    <7a8>   DW_AT_name        : (indirect string, offset: 0x110af): BDCR
    <7ac>   DW_AT_decl_file   : 5
    <7ac>   DW_AT_decl_line   : 433
    <7ae>   DW_AT_decl_column : 17
    <7ae>   DW_AT_type        : <0x6ee>
    <7b2>   DW_AT_data_member_location: 32
 <2><7b3>: Abbrev Number: 6 (DW_TAG_member)
    <7b4>   DW_AT_name        : CSR
    <7b8>   DW_AT_decl_file   : 5
    <7b8>   DW_AT_decl_line   : 434
    <7ba>   DW_AT_decl_column : 17
    <7ba>   DW_AT_type        : <0x6ee>
    <7be>   DW_AT_data_member_location: 36
 <2><7bf>: Abbrev Number: 0
 <1><7c0>: Abbrev Number: 15 (DW_TAG_typedef)
    <7c1>   DW_AT_name        : (indirect string, offset: 0x393c4): RCC_TypeDef
    <7c5>   DW_AT_decl_file   : 5
    <7c6>   DW_AT_decl_line   : 437
    <7c8>   DW_AT_decl_column : 3
    <7c9>   DW_AT_type        : <0x73e>
 <1><7cd>: Abbrev Number: 16 (DW_TAG_enumeration_type)
    <7ce>   DW_AT_encoding    : 7	(unsigned)
    <7cf>   DW_AT_byte_size   : 1
    <7d0>   DW_AT_type        : <0x686>
    <7d4>   DW_AT_decl_file   : 6
    <7d5>   DW_AT_decl_line   : 151
    <7d6>   DW_AT_decl_column : 1
    <7d7>   DW_AT_sibling     : <0x7e8>
 <2><7db>: Abbrev Number: 17 (DW_TAG_enumerator)
    <7dc>   DW_AT_name        : (indirect string, offset: 0x6caec): RESET
    <7e0>   DW_AT_const_value : 0
 <2><7e1>: Abbrev Number: 18 (DW_TAG_enumerator)
    <7e2>   DW_AT_name        : SET
    <7e6>   DW_AT_const_value : 1
 <2><7e7>: Abbrev Number: 0
 <1><7e8>: Abbrev Number: 1 (DW_TAG_base_type)
    <7e9>   DW_AT_byte_size   : 8
    <7ea>   DW_AT_encoding    : 4	(float)
    <7eb>   DW_AT_name        : (indirect string, offset: 0x1380f): long double
 <1><7ef>: Abbrev Number: 7 (DW_TAG_variable)
    <7f0>   DW_AT_specification: <0x6f3>
    <7f4>   DW_AT_decl_file   : 1
    <7f4>   DW_AT_decl_line   : 141
    <7f5>   DW_AT_decl_column : 10
    <7f6>   DW_AT_location    : 5 byte block: 3 0 0 0 20 	(DW_OP_addr: 20000000)
 <1><7fc>: Abbrev Number: 7 (DW_TAG_variable)
    <7fd>   DW_AT_specification: <0x713>
    <801>   DW_AT_decl_file   : 1
    <801>   DW_AT_decl_line   : 142
    <802>   DW_AT_decl_column : 15
    <803>   DW_AT_location    : 5 byte block: 3 d0 d 0 8 	(DW_OP_addr: 8000dd0)
 <1><809>: Abbrev Number: 7 (DW_TAG_variable)
    <80a>   DW_AT_specification: <0x733>
    <80e>   DW_AT_decl_file   : 1
    <80e>   DW_AT_decl_line   : 143
    <80f>   DW_AT_decl_column : 15
    <810>   DW_AT_location    : 5 byte block: 3 0 0 0 0 	(DW_OP_addr: 0)
 <1><816>: Abbrev Number: 19 (DW_TAG_subprogram)
    <817>   DW_AT_external    : 1
    <817>   DW_AT_name        : (indirect string, offset: 0x7abff): SystemCoreClockUpdate
    <81b>   DW_AT_decl_file   : 1
    <81c>   DW_AT_decl_line   : 224
    <81d>   DW_AT_decl_column : 6
    <81e>   DW_AT_prototyped  : 1
    <81e>   DW_AT_low_pc      : 0x0
    <822>   DW_AT_high_pc     : 0xe4
    <826>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <828>   DW_AT_call_all_calls: 1
    <828>   DW_AT_sibling     : <0x858>
 <2><82c>: Abbrev Number: 20 (DW_TAG_variable)
    <82d>   DW_AT_name        : tmp
    <831>   DW_AT_decl_file   : 1
    <832>   DW_AT_decl_line   : 226
    <833>   DW_AT_decl_column : 12
    <834>   DW_AT_type        : <0x6e2>
    <838>   DW_AT_location    : 2 byte block: 91 74 	(DW_OP_fbreg: -12)
 <2><83b>: Abbrev Number: 10 (DW_TAG_variable)
    <83c>   DW_AT_name        : (indirect string, offset: 0x7abf7): pllmull
    <840>   DW_AT_decl_file   : 1
    <840>   DW_AT_decl_line   : 226
    <841>   DW_AT_decl_column : 22
    <842>   DW_AT_type        : <0x6e2>
    <846>   DW_AT_location    : 2 byte block: 91 70 	(DW_OP_fbreg: -16)
 <2><849>: Abbrev Number: 10 (DW_TAG_variable)
    <84a>   DW_AT_name        : (indirect string, offset: 0x7abb5): pllsource
    <84e>   DW_AT_decl_file   : 1
    <84e>   DW_AT_decl_line   : 226
    <84f>   DW_AT_decl_column : 36
    <850>   DW_AT_type        : <0x6e2>
    <854>   DW_AT_location    : 2 byte block: 91 6c 	(DW_OP_fbreg: -20)
 <2><857>: Abbrev Number: 0
 <1><858>: Abbrev Number: 21 (DW_TAG_subprogram)
    <859>   DW_AT_external    : 1
    <859>   DW_AT_name        : (indirect string, offset: 0x7abbf): SystemInit
    <85d>   DW_AT_decl_file   : 1
    <85e>   DW_AT_decl_line   : 175
    <85f>   DW_AT_decl_column : 6
    <860>   DW_AT_prototyped  : 1
    <860>   DW_AT_low_pc      : 0x80002be
    <864>   DW_AT_high_pc     : 0xc
    <868>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <86a>   DW_AT_call_all_calls: 1
 <1><86a>: Abbrev Number: 0
  Compilation Unit @ offset 0x86b:
   Length:        0x1f (32-bit)
   Version:       5
   Unit Type:     DW_UT_compile (1)
   Abbrev Offset: 0x449
   Pointer Size:  4
 <0><877>: Abbrev Number: 1 (DW_TAG_compile_unit)
    <878>   DW_AT_stmt_list   : 0x1c8c
    <87c>   DW_AT_ranges      : 0xa1
    <880>   DW_AT_name        : (indirect string, offset: 0x7ac33): ../Core/Startup/startup_stm32f103c8tx.s
    <884>   DW_AT_comp_dir    : (indirect string, offset: 0x123a4): F:/HEATER SYSTEM PID/CODE/Debug
    <888>   DW_AT_producer    : (indirect string, offset: 0x7ac5b): GNU AS 2.38
    <88c>   DW_AT_language    : 32769	(MIPS assembler)
  Compilation Unit @ offset 0x88e:
   Length:        0x700 (32-bit)
   Version:       5
   Unit Type:     DW_UT_compile (1)
   Abbrev Offset: 0x45b
   Pointer Size:  4
 <0><89a>: Abbrev Number: 20 (DW_TAG_compile_unit)
    <89b>   DW_AT_producer    : (indirect string, offset: 0x4ec7b): GNU C11 11.3.1 20220712 -mcpu=cortex-m3 -mfloat-abi=soft -mthumb -march=armv7-m -g3 -O0 -std=gnu11 -ffunction-sections -fdata-sections -fstack-usage -fcyclomatic-complexity
    <89f>   DW_AT_language    : 29	(C11)
    <8a0>   DW_AT_name        : (indirect string, offset: 0x7adfb): ../Drivers/STM32F1xx_HAL_Driver/Src/stm32f1xx_hal.c
    <8a4>   DW_AT_comp_dir    : (indirect string, offset: 0x123a4): F:/HEATER SYSTEM PID/CODE/Debug
    <8a8>   DW_AT_ranges      : 0xba
    <8ac>   DW_AT_low_pc      : 0x0
    <8b0>   DW_AT_stmt_list   : 0x1d04
    <8b4>   DW_AT_macros      : 0x15246
 <1><8b8>: Abbrev Number: 14 (DW_TAG_enumeration_type)
    <8b9>   DW_AT_encoding    : 5	(signed)
    <8ba>   DW_AT_byte_size   : 1
    <8ba>   DW_AT_type        : <0x9fd>
    <8be>   DW_AT_decl_file   : 2
    <8bf>   DW_AT_decl_line   : 69
    <8c0>   DW_AT_decl_column : 1
    <8c0>   DW_AT_sibling     : <0x9fd>
 <2><8c4>: Abbrev Number: 5 (DW_TAG_enumerator)
    <8c5>   DW_AT_name        : (indirect string, offset: 0x7ad60): NonMaskableInt_IRQn
    <8c9>   DW_AT_const_value : -14
 <2><8ca>: Abbrev Number: 5 (DW_TAG_enumerator)
    <8cb>   DW_AT_name        : (indirect string, offset: 0x7acfc): HardFault_IRQn
    <8cf>   DW_AT_const_value : -13
 <2><8d0>: Abbrev Number: 5 (DW_TAG_enumerator)
    <8d1>   DW_AT_name        : (indirect string, offset: 0x7af3c): MemoryManagement_IRQn
    <8d5>   DW_AT_const_value : -12
 <2><8d6>: Abbrev Number: 5 (DW_TAG_enumerator)
    <8d7>   DW_AT_name        : (indirect string, offset: 0x7b13e): BusFault_IRQn
    <8db>   DW_AT_const_value : -11
 <2><8dc>: Abbrev Number: 5 (DW_TAG_enumerator)
    <8dd>   DW_AT_name        : (indirect string, offset: 0x7affb): UsageFault_IRQn
    <8e1>   DW_AT_const_value : -10
 <2><8e2>: Abbrev Number: 5 (DW_TAG_enumerator)
    <8e3>   DW_AT_name        : (indirect string, offset: 0x7ac71): SVCall_IRQn
    <8e7>   DW_AT_const_value : -5
 <2><8e8>: Abbrev Number: 5 (DW_TAG_enumerator)
    <8e9>   DW_AT_name        : (indirect string, offset: 0x7af52): DebugMonitor_IRQn
    <8ed>   DW_AT_const_value : -4
 <2><8ee>: Abbrev Number: 5 (DW_TAG_enumerator)
    <8ef>   DW_AT_name        : (indirect string, offset: 0x7af96): PendSV_IRQn
    <8f3>   DW_AT_const_value : -2
 <2><8f4>: Abbrev Number: 5 (DW_TAG_enumerator)
    <8f5>   DW_AT_name        : (indirect string, offset: 0x7b191): SysTick_IRQn
    <8f9>   DW_AT_const_value : -1
 <2><8fa>: Abbrev Number: 1 (DW_TAG_enumerator)
    <8fb>   DW_AT_name        : (indirect string, offset: 0x7b037): WWDG_IRQn
    <8ff>   DW_AT_const_value : 0
 <2><900>: Abbrev Number: 1 (DW_TAG_enumerator)
    <901>   DW_AT_name        : (indirect string, offset: 0x7ad57): PVD_IRQn
    <905>   DW_AT_const_value : 1
 <2><906>: Abbrev Number: 1 (DW_TAG_enumerator)
    <907>   DW_AT_name        : (indirect string, offset: 0x7ae48): TAMPER_IRQn
    <90b>   DW_AT_const_value : 2
 <2><90c>: Abbrev Number: 1 (DW_TAG_enumerator)
    <90d>   DW_AT_name        : (indirect string, offset: 0x7af6f): RTC_IRQn
    <911>   DW_AT_const_value : 3
 <2><912>: Abbrev Number: 1 (DW_TAG_enumerator)
    <913>   DW_AT_name        : (indirect string, offset: 0x7adb4): FLASH_IRQn
    <917>   DW_AT_const_value : 4
 <2><918>: Abbrev Number: 1 (DW_TAG_enumerator)
    <919>   DW_AT_name        : (indirect string, offset: 0x7b135): RCC_IRQn
    <91d>   DW_AT_const_value : 5
 <2><91e>: Abbrev Number: 1 (DW_TAG_enumerator)
    <91f>   DW_AT_name        : (indirect string, offset: 0x7af64): EXTI0_IRQn
    <923>   DW_AT_const_value : 6
 <2><924>: Abbrev Number: 1 (DW_TAG_enumerator)
    <925>   DW_AT_name        : (indirect string, offset: 0x7b22f): EXTI1_IRQn
    <929>   DW_AT_const_value : 7
 <2><92a>: Abbrev Number: 1 (DW_TAG_enumerator)
    <92b>   DW_AT_name        : (indirect string, offset: 0x7aee6): EXTI2_IRQn
    <92f>   DW_AT_const_value : 8
 <2><930>: Abbrev Number: 1 (DW_TAG_enumerator)
    <931>   DW_AT_name        : (indirect string, offset: 0x7b19e): EXTI3_IRQn
    <935>   DW_AT_const_value : 9
 <2><936>: Abbrev Number: 1 (DW_TAG_enumerator)
    <937>   DW_AT_name        : (indirect string, offset: 0x7ad4c): EXTI4_IRQn
    <93b>   DW_AT_const_value : 10
 <2><93c>: Abbrev Number: 1 (DW_TAG_enumerator)
    <93d>   DW_AT_name        : (indirect string, offset: 0x7add8): DMA1_Channel1_IRQn
    <941>   DW_AT_const_value : 11
 <2><942>: Abbrev Number: 1 (DW_TAG_enumerator)
    <943>   DW_AT_name        : (indirect string, offset: 0x7b04d): DMA1_Channel2_IRQn
    <947>   DW_AT_const_value : 12
 <2><948>: Abbrev Number: 1 (DW_TAG_enumerator)
    <949>   DW_AT_name        : (indirect string, offset: 0x7ad2c): DMA1_Channel3_IRQn
    <94d>   DW_AT_const_value : 13
 <2><94e>: Abbrev Number: 1 (DW_TAG_enumerator)
    <94f>   DW_AT_name        : (indirect string, offset: 0x7afbb): DMA1_Channel4_IRQn
    <953>   DW_AT_const_value : 14
 <2><954>: Abbrev Number: 1 (DW_TAG_enumerator)
    <955>   DW_AT_name        : (indirect string, offset: 0x7ac98): DMA1_Channel5_IRQn
    <959>   DW_AT_const_value : 15
 <2><95a>: Abbrev Number: 1 (DW_TAG_enumerator)
    <95b>   DW_AT_name        : (indirect string, offset: 0x7aef1): DMA1_Channel6_IRQn
    <95f>   DW_AT_const_value : 16
 <2><960>: Abbrev Number: 1 (DW_TAG_enumerator)
    <961>   DW_AT_name        : (indirect string, offset: 0x7b1fa): DMA1_Channel7_IRQn
    <965>   DW_AT_const_value : 17
 <2><966>: Abbrev Number: 1 (DW_TAG_enumerator)
    <967>   DW_AT_name        : (indirect string, offset: 0x412ba): ADC1_2_IRQn
    <96b>   DW_AT_const_value : 18
 <2><96c>: Abbrev Number: 1 (DW_TAG_enumerator)
    <96d>   DW_AT_name        : (indirect string, offset: 0x36249): USB_HP_CAN1_TX_IRQn
    <971>   DW_AT_const_value : 19
 <2><972>: Abbrev Number: 1 (DW_TAG_enumerator)
    <973>   DW_AT_name        : (indirect string, offset: 0x75b85): USB_LP_CAN1_RX0_IRQn
    <977>   DW_AT_const_value : 20
 <2><978>: Abbrev Number: 1 (DW_TAG_enumerator)
    <979>   DW_AT_name        : (indirect string, offset: 0x7b029): CAN1_RX1_IRQn
    <97d>   DW_AT_const_value : 21
 <2><97e>: Abbrev Number: 1 (DW_TAG_enumerator)
    <97f>   DW_AT_name        : (indirect string, offset: 0x7b00b): CAN1_SCE_IRQn
    <983>   DW_AT_const_value : 22
 <2><984>: Abbrev Number: 1 (DW_TAG_enumerator)
    <985>   DW_AT_name        : (indirect string, offset: 0x7b20d): EXTI9_5_IRQn
    <989>   DW_AT_const_value : 23
 <2><98a>: Abbrev Number: 1 (DW_TAG_enumerator)
    <98b>   DW_AT_name        : (indirect string, offset: 0x22255): TIM1_BRK_IRQn
    <98f>   DW_AT_const_value : 24
 <2><990>: Abbrev Number: 1 (DW_TAG_enumerator)
    <991>   DW_AT_name        : (indirect string, offset: 0x48b56): TIM1_UP_IRQn
    <995>   DW_AT_const_value : 25
 <2><996>: Abbrev Number: 1 (DW_TAG_enumerator)
    <997>   DW_AT_name        : (indirect string, offset: 0x2789a): TIM1_TRG_COM_IRQn
    <99b>   DW_AT_const_value : 26
 <2><99c>: Abbrev Number: 1 (DW_TAG_enumerator)
    <99d>   DW_AT_name        : (indirect string, offset: 0x7b11b): TIM1_CC_IRQn
    <9a1>   DW_AT_const_value : 27
 <2><9a2>: Abbrev Number: 1 (DW_TAG_enumerator)
    <9a3>   DW_AT_name        : (indirect string, offset: 0x7ad22): TIM2_IRQn
    <9a7>   DW_AT_const_value : 28
 <2><9a8>: Abbrev Number: 1 (DW_TAG_enumerator)
    <9a9>   DW_AT_name        : (indirect string, offset: 0x7afb1): TIM3_IRQn
    <9ad>   DW_AT_const_value : 29
 <2><9ae>: Abbrev Number: 1 (DW_TAG_enumerator)
    <9af>   DW_AT_name        : (indirect string, offset: 0x7ae3e): TIM4_IRQn
    <9b3>   DW_AT_const_value : 30
 <2><9b4>: Abbrev Number: 1 (DW_TAG_enumerator)
    <9b5>   DW_AT_name        : (indirect string, offset: 0x7ae5a): I2C1_EV_IRQn
    <9b9>   DW_AT_const_value : 31
 <2><9ba>: Abbrev Number: 1 (DW_TAG_enumerator)
    <9bb>   DW_AT_name        : (indirect string, offset: 0x7afce): I2C1_ER_IRQn
    <9bf>   DW_AT_const_value : 32
 <2><9c0>: Abbrev Number: 1 (DW_TAG_enumerator)
    <9c1>   DW_AT_name        : (indirect string, offset: 0x7ad0b): I2C2_EV_IRQn
    <9c5>   DW_AT_const_value : 33
 <2><9c6>: Abbrev Number: 1 (DW_TAG_enumerator)
    <9c7>   DW_AT_name        : (indirect string, offset: 0x7aecf): I2C2_ER_IRQn
    <9cb>   DW_AT_const_value : 34
 <2><9cc>: Abbrev Number: 1 (DW_TAG_enumerator)
    <9cd>   DW_AT_name        : (indirect string, offset: 0x7ad18): SPI1_IRQn
    <9d1>   DW_AT_const_value : 35
 <2><9d2>: Abbrev Number: 1 (DW_TAG_enumerator)
    <9d3>   DW_AT_name        : (indirect string, offset: 0x7afa7): SPI2_IRQn
    <9d7>   DW_AT_const_value : 36
 <2><9d8>: Abbrev Number: 1 (DW_TAG_enumerator)
    <9d9>   DW_AT_name        : (indirect string, offset: 0x7b171): USART1_IRQn
    <9dd>   DW_AT_const_value : 37
 <2><9de>: Abbrev Number: 1 (DW_TAG_enumerator)
    <9df>   DW_AT_name        : (indirect string, offset: 0x7adcc): USART2_IRQn
    <9e3>   DW_AT_const_value : 38
 <2><9e4>: Abbrev Number: 1 (DW_TAG_enumerator)
    <9e5>   DW_AT_name        : (indirect string, offset: 0x7b041): USART3_IRQn
    <9e9>   DW_AT_const_value : 39
 <2><9ea>: Abbrev Number: 1 (DW_TAG_enumerator)
    <9eb>   DW_AT_name        : (indirect string, offset: 0x7b1cb): EXTI15_10_IRQn
    <9ef>   DW_AT_const_value : 40
 <2><9f0>: Abbrev Number: 1 (DW_TAG_enumerator)
    <9f1>   DW_AT_name        : (indirect string, offset: 0x7b1e1): RTC_Alarm_IRQn
    <9f5>   DW_AT_const_value : 41
 <2><9f6>: Abbrev Number: 1 (DW_TAG_enumerator)
    <9f7>   DW_AT_name        : (indirect string, offset: 0x762e0): USBWakeUp_IRQn
    <9fb>   DW_AT_const_value : 42
 <2><9fc>: Abbrev Number: 0
 <1><9fd>: Abbrev Number: 3 (DW_TAG_base_type)
    <9fe>   DW_AT_byte_size   : 1
    <9ff>   DW_AT_encoding    : 6	(signed char)
    <a00>   DW_AT_name        : (indirect string, offset: 0x3d7e9): signed char
 <1><a04>: Abbrev Number: 8 (DW_TAG_typedef)
    <a05>   DW_AT_name        : (indirect string, offset: 0x7b1f0): IRQn_Type
    <a09>   DW_AT_decl_file   : 2
    <a0a>   DW_AT_decl_line   : 125
    <a0b>   DW_AT_decl_column : 3
    <a0c>   DW_AT_type        : <0x8b8>
 <1><a10>: Abbrev Number: 3 (DW_TAG_base_type)
    <a11>   DW_AT_byte_size   : 1
    <a12>   DW_AT_encoding    : 8	(unsigned char)
    <a13>   DW_AT_name        : (indirect string, offset: 0x19162): unsigned char
 <1><a17>: Abbrev Number: 3 (DW_TAG_base_type)
    <a18>   DW_AT_byte_size   : 2
    <a19>   DW_AT_encoding    : 5	(signed)
    <a1a>   DW_AT_name        : (indirect string, offset: 0x5b395): short int
 <1><a1e>: Abbrev Number: 3 (DW_TAG_base_type)
    <a1f>   DW_AT_byte_size   : 2
    <a20>   DW_AT_encoding    : 7	(unsigned)
    <a21>   DW_AT_name        : (indirect string, offset: 0x28427): short unsigned int
 <1><a25>: Abbrev Number: 3 (DW_TAG_base_type)
    <a26>   DW_AT_byte_size   : 4
    <a27>   DW_AT_encoding    : 5	(signed)
    <a28>   DW_AT_name        : (indirect string, offset: 0xab4c): long int
 <1><a2c>: Abbrev Number: 8 (DW_TAG_typedef)
    <a2d>   DW_AT_name        : (indirect string, offset: 0x4dfcc): __uint32_t
    <a31>   DW_AT_decl_file   : 3
    <a32>   DW_AT_decl_line   : 79
    <a33>   DW_AT_decl_column : 25
    <a34>   DW_AT_type        : <0xa38>
 <1><a38>: Abbrev Number: 3 (DW_TAG_base_type)
    <a39>   DW_AT_byte_size   : 4
    <a3a>   DW_AT_encoding    : 7	(unsigned)
    <a3b>   DW_AT_name        : (indirect string, offset: 0x1cfc3): long unsigned int
 <1><a3f>: Abbrev Number: 3 (DW_TAG_base_type)
    <a40>   DW_AT_byte_size   : 8
    <a41>   DW_AT_encoding    : 5	(signed)
    <a42>   DW_AT_name        : (indirect string, offset: 0x3861e): long long int
 <1><a46>: Abbrev Number: 3 (DW_TAG_base_type)
    <a47>   DW_AT_byte_size   : 8
    <a48>   DW_AT_encoding    : 7	(unsigned)
    <a49>   DW_AT_name        : (indirect string, offset: 0x1981f): long long unsigned int
 <1><a4d>: Abbrev Number: 21 (DW_TAG_base_type)
    <a4e>   DW_AT_byte_size   : 4
    <a4f>   DW_AT_encoding    : 5	(signed)
    <a50>   DW_AT_name        : int
 <1><a54>: Abbrev Number: 3 (DW_TAG_base_type)
    <a55>   DW_AT_byte_size   : 4
    <a56>   DW_AT_encoding    : 7	(unsigned)
    <a57>   DW_AT_name        : (indirect string, offset: 0xa50f): unsigned int
 <1><a5b>: Abbrev Number: 8 (DW_TAG_typedef)
    <a5c>   DW_AT_name        : (indirect string, offset: 0x4dfce): uint32_t
    <a60>   DW_AT_decl_file   : 4
    <a61>   DW_AT_decl_line   : 48
    <a62>   DW_AT_decl_column : 20
    <a63>   DW_AT_type        : <0xa2c>
 <1><a67>: Abbrev Number: 22 (DW_TAG_volatile_type)
    <a68>   DW_AT_type        : <0xa5b>
 <1><a6c>: Abbrev Number: 23 (DW_TAG_const_type)
    <a6d>   DW_AT_type        : <0xa67>
 <1><a71>: Abbrev Number: 10 (DW_TAG_structure_type)
    <a72>   DW_AT_byte_size   : 16
    <a73>   DW_AT_decl_file   : 5
    <a74>   DW_AT_decl_line   : 694
    <a76>   DW_AT_decl_column : 9
    <a76>   DW_AT_sibling     : <0xab3>
 <2><a7a>: Abbrev Number: 2 (DW_TAG_member)
    <a7b>   DW_AT_name        : (indirect string, offset: 0x7afa2): CTRL
    <a7f>   DW_AT_decl_file   : 5
    <a80>   DW_AT_decl_line   : 696
    <a82>   DW_AT_decl_column : 18
    <a83>   DW_AT_type        : <0xa67>
    <a87>   DW_AT_data_member_location: 0
 <2><a88>: Abbrev Number: 2 (DW_TAG_member)
    <a89>   DW_AT_name        : (indirect string, offset: 0x63045): LOAD
    <a8d>   DW_AT_decl_file   : 5
    <a8e>   DW_AT_decl_line   : 697
    <a90>   DW_AT_decl_column : 18
    <a91>   DW_AT_type        : <0xa67>
    <a95>   DW_AT_data_member_location: 4
 <2><a96>: Abbrev Number: 4 (DW_TAG_member)
    <a97>   DW_AT_name        : VAL
    <a9b>   DW_AT_decl_file   : 5
    <a9c>   DW_AT_decl_line   : 698
    <a9e>   DW_AT_decl_column : 18
    <a9f>   DW_AT_type        : <0xa67>
    <aa3>   DW_AT_data_member_location: 8
 <2><aa4>: Abbrev Number: 2 (DW_TAG_member)
    <aa5>   DW_AT_name        : (indirect string, offset: 0x7ae54): CALIB
    <aa9>   DW_AT_decl_file   : 5
    <aaa>   DW_AT_decl_line   : 699
    <aac>   DW_AT_decl_column : 18
    <aad>   DW_AT_type        : <0xa6c>
    <ab1>   DW_AT_data_member_location: 12
 <2><ab2>: Abbrev Number: 0
 <1><ab3>: Abbrev Number: 11 (DW_TAG_typedef)
    <ab4>   DW_AT_name        : (indirect string, offset: 0x7adbf): SysTick_Type
    <ab8>   DW_AT_decl_file   : 5
    <ab9>   DW_AT_decl_line   : 700
    <abb>   DW_AT_decl_column : 3
    <abc>   DW_AT_type        : <0xa71>
 <1><ac0>: Abbrev Number: 12 (DW_TAG_variable)
    <ac1>   DW_AT_name        : (indirect string, offset: 0x7ac15): SystemCoreClock
    <ac5>   DW_AT_decl_file   : 8
    <ac6>   DW_AT_decl_line   : 50
    <ac7>   DW_AT_decl_column : 17
    <ac8>   DW_AT_type        : <0xa5b>
    <acc>   DW_AT_external    : 1
    <acc>   DW_AT_declaration : 1
 <1><acc>: Abbrev Number: 10 (DW_TAG_structure_type)
    <acd>   DW_AT_byte_size   : 8
    <ace>   DW_AT_decl_file   : 2
    <acf>   DW_AT_decl_line   : 280
    <ad1>   DW_AT_decl_column : 9
    <ad1>   DW_AT_sibling     : <0xaf1>
 <2><ad5>: Abbrev Number: 2 (DW_TAG_member)
    <ad6>   DW_AT_name        : (indirect string, offset: 0x7b1da): IDCODE
    <ada>   DW_AT_decl_file   : 2
    <adb>   DW_AT_decl_line   : 282
    <add>   DW_AT_decl_column : 17
    <ade>   DW_AT_type        : <0xa67>
    <ae2>   DW_AT_data_member_location: 0
 <2><ae3>: Abbrev Number: 4 (DW_TAG_member)
    <ae4>   DW_AT_name        : CR
    <ae7>   DW_AT_decl_file   : 2
    <ae8>   DW_AT_decl_line   : 283
    <aea>   DW_AT_decl_column : 17
    <aeb>   DW_AT_type        : <0xa67>
    <aef>   DW_AT_data_member_location: 4
 <2><af0>: Abbrev Number: 0
 <1><af1>: Abbrev Number: 11 (DW_TAG_typedef)
    <af2>   DW_AT_name        : (indirect string, offset: 0x7ae2f): DBGMCU_TypeDef
    <af6>   DW_AT_decl_file   : 2
    <af7>   DW_AT_decl_line   : 284
    <af9>   DW_AT_decl_column : 2
    <afa>   DW_AT_type        : <0xacc>
 <1><afe>: Abbrev Number: 10 (DW_TAG_structure_type)
    <aff>   DW_AT_byte_size   : 36
    <b00>   DW_AT_decl_file   : 2
    <b01>   DW_AT_decl_line   : 324
    <b03>   DW_AT_decl_column : 9
    <b03>   DW_AT_sibling     : <0xb83>
 <2><b07>: Abbrev Number: 4 (DW_TAG_member)
    <b08>   DW_AT_name        : ACR
    <b0c>   DW_AT_decl_file   : 2
    <b0d>   DW_AT_decl_line   : 326
    <b0f>   DW_AT_decl_column : 17
    <b10>   DW_AT_type        : <0xa67>
    <b14>   DW_AT_data_member_location: 0
 <2><b15>: Abbrev Number: 2 (DW_TAG_member)
    <b16>   DW_AT_name        : (indirect string, offset: 0x7b25b): KEYR
    <b1a>   DW_AT_decl_file   : 2
    <b1b>   DW_AT_decl_line   : 327
    <b1d>   DW_AT_decl_column : 17
    <b1e>   DW_AT_type        : <0xa67>
    <b22>   DW_AT_data_member_location: 4
 <2><b23>: Abbrev Number: 2 (DW_TAG_member)
    <b24>   DW_AT_name        : (indirect string, offset: 0x7b258): OPTKEYR
    <b28>   DW_AT_decl_file   : 2
    <b29>   DW_AT_decl_line   : 328
    <b2b>   DW_AT_decl_column : 17
    <b2c>   DW_AT_type        : <0xa67>
    <b30>   DW_AT_data_member_location: 8
 <2><b31>: Abbrev Number: 4 (DW_TAG_member)
    <b32>   DW_AT_name        : SR
    <b35>   DW_AT_decl_file   : 2
    <b36>   DW_AT_decl_line   : 329
    <b38>   DW_AT_decl_column : 17
    <b39>   DW_AT_type        : <0xa67>
    <b3d>   DW_AT_data_member_location: 12
 <2><b3e>: Abbrev Number: 4 (DW_TAG_member)
    <b3f>   DW_AT_name        : CR
    <b42>   DW_AT_decl_file   : 2
    <b43>   DW_AT_decl_line   : 330
    <b45>   DW_AT_decl_column : 17
    <b46>   DW_AT_type        : <0xa67>
    <b4a>   DW_AT_data_member_location: 16
 <2><b4b>: Abbrev Number: 4 (DW_TAG_member)
    <b4c>   DW_AT_name        : AR
    <b4f>   DW_AT_decl_file   : 2
    <b50>   DW_AT_decl_line   : 331
    <b52>   DW_AT_decl_column : 17
    <b53>   DW_AT_type        : <0xa67>
    <b57>   DW_AT_data_member_location: 20
 <2><b58>: Abbrev Number: 2 (DW_TAG_member)
    <b59>   DW_AT_name        : (indirect string, offset: 0x4a46d): RESERVED
    <b5d>   DW_AT_decl_file   : 2
    <b5e>   DW_AT_decl_line   : 332
    <b60>   DW_AT_decl_column : 17
    <b61>   DW_AT_type        : <0xa67>
    <b65>   DW_AT_data_member_location: 24
 <2><b66>: Abbrev Number: 4 (DW_TAG_member)
    <b67>   DW_AT_name        : OBR
    <b6b>   DW_AT_decl_file   : 2
    <b6c>   DW_AT_decl_line   : 333
    <b6e>   DW_AT_decl_column : 17
    <b6f>   DW_AT_type        : <0xa67>
    <b73>   DW_AT_data_member_location: 28
 <2><b74>: Abbrev Number: 2 (DW_TAG_member)
    <b75>   DW_AT_name        : (indirect string, offset: 0x7b22a): WRPR
    <b79>   DW_AT_decl_file   : 2
    <b7a>   DW_AT_decl_line   : 334
    <b7c>   DW_AT_decl_column : 17
    <b7d>   DW_AT_type        : <0xa67>
    <b81>   DW_AT_data_member_location: 32
 <2><b82>: Abbrev Number: 0
 <1><b83>: Abbrev Number: 11 (DW_TAG_typedef)
    <b84>   DW_AT_name        : (indirect string, offset: 0x7afed): FLASH_TypeDef
    <b88>   DW_AT_decl_file   : 2
    <b89>   DW_AT_decl_line   : 335
    <b8b>   DW_AT_decl_column : 3
    <b8c>   DW_AT_type        : <0xafe>
 <1><b90>: Abbrev Number: 10 (DW_TAG_structure_type)
    <b91>   DW_AT_byte_size   : 40
    <b92>   DW_AT_decl_file   : 2
    <b93>   DW_AT_decl_line   : 423
    <b95>   DW_AT_decl_column : 9
    <b95>   DW_AT_sibling     : <0xc25>
 <2><b99>: Abbrev Number: 4 (DW_TAG_member)
    <b9a>   DW_AT_name        : CR
    <b9d>   DW_AT_decl_file   : 2
    <b9e>   DW_AT_decl_line   : 425
    <ba0>   DW_AT_decl_column : 17
    <ba1>   DW_AT_type        : <0xa67>
    <ba5>   DW_AT_data_member_location: 0
 <2><ba6>: Abbrev Number: 2 (DW_TAG_member)
    <ba7>   DW_AT_name        : (indirect string, offset: 0x4a7a2): CFGR
    <bab>   DW_AT_decl_file   : 2
    <bac>   DW_AT_decl_line   : 426
    <bae>   DW_AT_decl_column : 17
    <baf>   DW_AT_type        : <0xa67>
    <bb3>   DW_AT_data_member_location: 4
 <2><bb4>: Abbrev Number: 4 (DW_TAG_member)
    <bb5>   DW_AT_name        : CIR
    <bb9>   DW_AT_decl_file   : 2
    <bba>   DW_AT_decl_line   : 427
    <bbc>   DW_AT_decl_column : 17
    <bbd>   DW_AT_type        : <0xa67>
    <bc1>   DW_AT_data_member_location: 8
 <2><bc2>: Abbrev Number: 2 (DW_TAG_member)
    <bc3>   DW_AT_name        : (indirect string, offset: 0x359c9): APB2RSTR
    <bc7>   DW_AT_decl_file   : 2
    <bc8>   DW_AT_decl_line   : 428
    <bca>   DW_AT_decl_column : 17
    <bcb>   DW_AT_type        : <0xa67>
    <bcf>   DW_AT_data_member_location: 12
 <2><bd0>: Abbrev Number: 2 (DW_TAG_member)
    <bd1>   DW_AT_name        : (indirect string, offset: 0xe117): APB1RSTR
    <bd5>   DW_AT_decl_file   : 2
    <bd6>   DW_AT_decl_line   : 429
    <bd8>   DW_AT_decl_column : 17
    <bd9>   DW_AT_type        : <0xa67>
    <bdd>   DW_AT_data_member_location: 16
 <2><bde>: Abbrev Number: 2 (DW_TAG_member)
    <bdf>   DW_AT_name        : (indirect string, offset: 0xb8d0): AHBENR
    <be3>   DW_AT_decl_file   : 2
    <be4>   DW_AT_decl_line   : 430
    <be6>   DW_AT_decl_column : 17
    <be7>   DW_AT_type        : <0xa67>
    <beb>   DW_AT_data_member_location: 20
 <2><bec>: Abbrev Number: 2 (DW_TAG_member)
    <bed>   DW_AT_name        : (indirect string, offset: 0xeaaf): APB2ENR
    <bf1>   DW_AT_decl_file   : 2
    <bf2>   DW_AT_decl_line   : 431
    <bf4>   DW_AT_decl_column : 17
    <bf5>   DW_AT_type        : <0xa67>
    <bf9>   DW_AT_data_member_location: 24
 <2><bfa>: Abbrev Number: 2 (DW_TAG_member)
    <bfb>   DW_AT_name        : (indirect string, offset: 0x5c28a): APB1ENR
    <bff>   DW_AT_decl_file   : 2
    <c00>   DW_AT_decl_line   : 432
    <c02>   DW_AT_decl_column : 17
    <c03>   DW_AT_type        : <0xa67>
    <c07>   DW_AT_data_member_location: 28
 <2><c08>: Abbrev Number: 2 (DW_TAG_member)
    <c09>   DW_AT_name        : (indirect string, offset: 0x110af): BDCR
    <c0d>   DW_AT_decl_file   : 2
    <c0e>   DW_AT_decl_line   : 433
    <c10>   DW_AT_decl_column : 17
    <c11>   DW_AT_type        : <0xa67>
    <c15>   DW_AT_data_member_location: 32
 <2><c16>: Abbrev Number: 4 (DW_TAG_member)
    <c17>   DW_AT_name        : CSR
    <c1b>   DW_AT_decl_file   : 2
    <c1c>   DW_AT_decl_line   : 434
    <c1e>   DW_AT_decl_column : 17
    <c1f>   DW_AT_type        : <0xa67>
    <c23>   DW_AT_data_member_location: 36
 <2><c24>: Abbrev Number: 0
 <1><c25>: Abbrev Number: 11 (DW_TAG_typedef)
    <c26>   DW_AT_name        : (indirect string, offset: 0x393c4): RCC_TypeDef
    <c2a>   DW_AT_decl_file   : 2
    <c2b>   DW_AT_decl_line   : 437
    <c2d>   DW_AT_decl_column : 3
    <c2e>   DW_AT_type        : <0xb90>
 <1><c32>: Abbrev Number: 3 (DW_TAG_base_type)
    <c33>   DW_AT_byte_size   : 8
    <c34>   DW_AT_encoding    : 4	(float)
    <c35>   DW_AT_name        : (indirect string, offset: 0x1380f): long double
 <1><c39>: Abbrev Number: 14 (DW_TAG_enumeration_type)
    <c3a>   DW_AT_encoding    : 7	(unsigned)
    <c3b>   DW_AT_byte_size   : 1
    <c3b>   DW_AT_type        : <0xa10>
    <c3f>   DW_AT_decl_file   : 6
    <c40>   DW_AT_decl_line   : 39
    <c41>   DW_AT_decl_column : 1
    <c41>   DW_AT_sibling     : <0xc5e>
 <2><c45>: Abbrev Number: 1 (DW_TAG_enumerator)
    <c46>   DW_AT_name        : (indirect string, offset: 0x297e1): HAL_OK
    <c4a>   DW_AT_const_value : 0
 <2><c4b>: Abbrev Number: 1 (DW_TAG_enumerator)
    <c4c>   DW_AT_name        : (indirect string, offset: 0x4ca0e): HAL_ERROR
    <c50>   DW_AT_const_value : 1
 <2><c51>: Abbrev Number: 1 (DW_TAG_enumerator)
    <c52>   DW_AT_name        : (indirect string, offset: 0x1592a): HAL_BUSY
    <c56>   DW_AT_const_value : 2
 <2><c57>: Abbrev Number: 1 (DW_TAG_enumerator)
    <c58>   DW_AT_name        : (indirect string, offset: 0x243bd): HAL_TIMEOUT
    <c5c>   DW_AT_const_value : 3
 <2><c5d>: Abbrev Number: 0
 <1><c5e>: Abbrev Number: 8 (DW_TAG_typedef)
    <c5f>   DW_AT_name        : (indirect string, offset: 0x155c): HAL_StatusTypeDef
    <c63>   DW_AT_decl_file   : 6
    <c64>   DW_AT_decl_line   : 44
    <c65>   DW_AT_decl_column : 3
    <c66>   DW_AT_type        : <0xc39>
 <1><c6a>: Abbrev Number: 14 (DW_TAG_enumeration_type)
    <c6b>   DW_AT_encoding    : 7	(unsigned)
    <c6c>   DW_AT_byte_size   : 1
    <c6c>   DW_AT_type        : <0xa10>
    <c70>   DW_AT_decl_file   : 7
    <c71>   DW_AT_decl_line   : 49
    <c72>   DW_AT_decl_column : 1
    <c72>   DW_AT_sibling     : <0xc8f>
 <2><c76>: Abbrev Number: 1 (DW_TAG_enumerator)
    <c77>   DW_AT_name        : (indirect string, offset: 0x7af78): HAL_TICK_FREQ_10HZ
    <c7b>   DW_AT_const_value : 100
 <2><c7c>: Abbrev Number: 1 (DW_TAG_enumerator)
    <c7d>   DW_AT_name        : (indirect string, offset: 0x7aebb): HAL_TICK_FREQ_100HZ
    <c81>   DW_AT_const_value : 10
 <2><c82>: Abbrev Number: 1 (DW_TAG_enumerator)
    <c83>   DW_AT_name        : (indirect string, offset: 0x7af04): HAL_TICK_FREQ_1KHZ
    <c87>   DW_AT_const_value : 1
 <2><c88>: Abbrev Number: 1 (DW_TAG_enumerator)
    <c89>   DW_AT_name        : (indirect string, offset: 0x7aea5): HAL_TICK_FREQ_DEFAULT
    <c8d>   DW_AT_const_value : 1
 <2><c8e>: Abbrev Number: 0
 <1><c8f>: Abbrev Number: 8 (DW_TAG_typedef)
    <c90>   DW_AT_name        : (indirect string, offset: 0x7b17d): HAL_TickFreqTypeDef
    <c94>   DW_AT_decl_file   : 7
    <c95>   DW_AT_decl_line   : 54
    <c96>   DW_AT_decl_column : 3
    <c97>   DW_AT_type        : <0xc6a>
 <1><c9b>: Abbrev Number: 12 (DW_TAG_variable)
    <c9c>   DW_AT_name        : (indirect string, offset: 0x7b060): uwTick
    <ca0>   DW_AT_decl_file   : 7
    <ca1>   DW_AT_decl_line   : 59
    <ca2>   DW_AT_decl_column : 22
    <ca3>   DW_AT_type        : <0xa67>
    <ca7>   DW_AT_external    : 1
    <ca7>   DW_AT_declaration : 1
 <1><ca7>: Abbrev Number: 12 (DW_TAG_variable)
    <ca8>   DW_AT_name        : (indirect string, offset: 0x7b110): uwTickPrio
    <cac>   DW_AT_decl_file   : 7
    <cad>   DW_AT_decl_line   : 60
    <cae>   DW_AT_decl_column : 17
    <caf>   DW_AT_type        : <0xa5b>
    <cb3>   DW_AT_external    : 1
    <cb3>   DW_AT_declaration : 1
 <1><cb3>: Abbrev Number: 12 (DW_TAG_variable)
    <cb4>   DW_AT_name        : (indirect string, offset: 0x7b21f): uwTickFreq
    <cb8>   DW_AT_decl_file   : 7
    <cb9>   DW_AT_decl_line   : 61
    <cba>   DW_AT_decl_column : 28
    <cbb>   DW_AT_type        : <0xc8f>
    <cbf>   DW_AT_external    : 1
    <cbf>   DW_AT_declaration : 1
 <1><cbf>: Abbrev Number: 15 (DW_TAG_variable)
    <cc0>   DW_AT_specification: <0xc9b>
    <cc4>   DW_AT_decl_file   : 1
    <cc4>   DW_AT_decl_line   : 79
    <cc5>   DW_AT_decl_column : 15
    <cc6>   DW_AT_location    : 5 byte block: 3 28 0 0 20 	(DW_OP_addr: 20000028)
 <1><ccc>: Abbrev Number: 15 (DW_TAG_variable)
    <ccd>   DW_AT_specification: <0xca7>
    <cd1>   DW_AT_decl_file   : 1
    <cd1>   DW_AT_decl_line   : 80
    <cd2>   DW_AT_decl_column : 10
    <cd3>   DW_AT_location    : 5 byte block: 3 4 0 0 20 	(DW_OP_addr: 20000004)
 <1><cd9>: Abbrev Number: 15 (DW_TAG_variable)
    <cda>   DW_AT_specification: <0xcb3>
    <cde>   DW_AT_decl_file   : 1
    <cde>   DW_AT_decl_line   : 81
    <cdf>   DW_AT_decl_column : 21
    <ce0>   DW_AT_location    : 5 byte block: 3 8 0 0 20 	(DW_OP_addr: 20000008)
 <1><ce6>: Abbrev Number: 16 (DW_TAG_subprogram)
    <ce7>   DW_AT_external    : 1
    <ce7>   DW_AT_name        : (indirect string, offset: 0x7b1b6): HAL_NVIC_SetPriority
    <ceb>   DW_AT_decl_file   : 9
    <ceb>   DW_AT_decl_line   : 262
    <ced>   DW_AT_decl_column : 6
    <ced>   DW_AT_prototyped  : 1
    <ced>   DW_AT_declaration : 1
    <ced>   DW_AT_sibling     : <0xd01>
 <2><cf1>: Abbrev Number: 9 (DW_TAG_formal_parameter)
    <cf2>   DW_AT_type        : <0xa04>
 <2><cf6>: Abbrev Number: 9 (DW_TAG_formal_parameter)
    <cf7>   DW_AT_type        : <0xa5b>
 <2><cfb>: Abbrev Number: 9 (DW_TAG_formal_parameter)
    <cfc>   DW_AT_type        : <0xa5b>
 <2><d00>: Abbrev Number: 0
 <1><d01>: Abbrev Number: 24 (DW_TAG_subprogram)
    <d02>   DW_AT_external    : 1
    <d02>   DW_AT_name        : (indirect string, offset: 0x7b260): HAL_SYSTICK_Config
    <d06>   DW_AT_decl_file   : 9
    <d07>   DW_AT_decl_line   : 266
    <d09>   DW_AT_decl_column : 10
    <d0a>   DW_AT_prototyped  : 1
    <d0a>   DW_AT_type        : <0xa5b>
    <d0e>   DW_AT_declaration : 1
    <d0e>   DW_AT_sibling     : <0xd18>
 <2><d12>: Abbrev Number: 9 (DW_TAG_formal_parameter)
    <d13>   DW_AT_type        : <0xa5b>
 <2><d17>: Abbrev Number: 0
 <1><d18>: Abbrev Number: 16 (DW_TAG_subprogram)
    <d19>   DW_AT_external    : 1
    <d19>   DW_AT_name        : (indirect string, offset: 0x7acd0): HAL_NVIC_SetPriorityGrouping
    <d1d>   DW_AT_decl_file   : 9
    <d1d>   DW_AT_decl_line   : 261
    <d1f>   DW_AT_decl_column : 6
    <d1f>   DW_AT_prototyped  : 1
    <d1f>   DW_AT_declaration : 1
    <d1f>   DW_AT_sibling     : <0xd29>
 <2><d23>: Abbrev Number: 9 (DW_TAG_formal_parameter)
    <d24>   DW_AT_type        : <0xa5b>
 <2><d28>: Abbrev Number: 0
 <1><d29>: Abbrev Number: 6 (DW_TAG_subprogram)
    <d2a>   DW_AT_external    : 1
    <d2a>   DW_AT_name        : (indirect string, offset: 0x56436): HAL_DBGMCU_DisableDBGStandbyMode
    <d2e>   DW_AT_decl_file   : 1
    <d2e>   DW_AT_decl_line   : 585
    <d30>   DW_AT_decl_column : 6
    <d31>   DW_AT_prototyped  : 1
    <d31>   DW_AT_low_pc      : 0x0
    <d35>   DW_AT_high_pc     : 0x1c
    <d39>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <d3b>   DW_AT_call_all_calls: 1
 <1><d3b>: Abbrev Number: 6 (DW_TAG_subprogram)
    <d3c>   DW_AT_external    : 1
    <d3c>   DW_AT_name        : (indirect string, offset: 0x65d6e): HAL_DBGMCU_EnableDBGStandbyMode
    <d40>   DW_AT_decl_file   : 1
    <d40>   DW_AT_decl_line   : 569
    <d42>   DW_AT_decl_column : 6
    <d43>   DW_AT_prototyped  : 1
    <d43>   DW_AT_low_pc      : 0x0
    <d47>   DW_AT_high_pc     : 0x1c
    <d4b>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <d4d>   DW_AT_call_all_calls: 1
 <1><d4d>: Abbrev Number: 6 (DW_TAG_subprogram)
    <d4e>   DW_AT_external    : 1
    <d4e>   DW_AT_name        : (indirect string, offset: 0x5020c): HAL_DBGMCU_DisableDBGStopMode
    <d52>   DW_AT_decl_file   : 1
    <d52>   DW_AT_decl_line   : 553
    <d54>   DW_AT_decl_column : 6
    <d55>   DW_AT_prototyped  : 1
    <d55>   DW_AT_low_pc      : 0x0
    <d59>   DW_AT_high_pc     : 0x1c
    <d5d>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <d5f>   DW_AT_call_all_calls: 1
 <1><d5f>: Abbrev Number: 6 (DW_TAG_subprogram)
    <d60>   DW_AT_external    : 1
    <d60>   DW_AT_name        : (indirect string, offset: 0xa58e): HAL_DBGMCU_EnableDBGStopMode
    <d64>   DW_AT_decl_file   : 1
    <d64>   DW_AT_decl_line   : 537
    <d66>   DW_AT_decl_column : 6
    <d67>   DW_AT_prototyped  : 1
    <d67>   DW_AT_low_pc      : 0x0
    <d6b>   DW_AT_high_pc     : 0x1c
    <d6f>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <d71>   DW_AT_call_all_calls: 1
 <1><d71>: Abbrev Number: 6 (DW_TAG_subprogram)
    <d72>   DW_AT_external    : 1
    <d72>   DW_AT_name        : (indirect string, offset: 0x26b45): HAL_DBGMCU_DisableDBGSleepMode
    <d76>   DW_AT_decl_file   : 1
    <d76>   DW_AT_decl_line   : 507
    <d78>   DW_AT_decl_column : 6
    <d79>   DW_AT_prototyped  : 1
    <d79>   DW_AT_low_pc      : 0x0
    <d7d>   DW_AT_high_pc     : 0x1c
    <d81>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <d83>   DW_AT_call_all_calls: 1
 <1><d83>: Abbrev Number: 6 (DW_TAG_subprogram)
    <d84>   DW_AT_external    : 1
    <d84>   DW_AT_name        : (indirect string, offset: 0x5f3e6): HAL_DBGMCU_EnableDBGSleepMode
    <d88>   DW_AT_decl_file   : 1
    <d88>   DW_AT_decl_line   : 491
    <d8a>   DW_AT_decl_column : 6
    <d8b>   DW_AT_prototyped  : 1
    <d8b>   DW_AT_low_pc      : 0x0
    <d8f>   DW_AT_high_pc     : 0x1c
    <d93>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <d95>   DW_AT_call_all_calls: 1
 <1><d95>: Abbrev Number: 7 (DW_TAG_subprogram)
    <d96>   DW_AT_external    : 1
    <d96>   DW_AT_name        : (indirect string, offset: 0x7ae81): HAL_GetUIDw2
    <d9a>   DW_AT_decl_file   : 1
    <d9a>   DW_AT_decl_line   : 482
    <d9c>   DW_AT_decl_column : 10
    <d9d>   DW_AT_prototyped  : 1
    <d9d>   DW_AT_type        : <0xa5b>
    <da1>   DW_AT_low_pc      : 0x0
    <da5>   DW_AT_high_pc     : 0x14
    <da9>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <dab>   DW_AT_call_all_calls: 1
 <1><dab>: Abbrev Number: 7 (DW_TAG_subprogram)
    <dac>   DW_AT_external    : 1
    <dac>   DW_AT_name        : (indirect string, offset: 0x7ae74): HAL_GetUIDw1
    <db0>   DW_AT_decl_file   : 1
    <db0>   DW_AT_decl_line   : 473
    <db2>   DW_AT_decl_column : 10
    <db3>   DW_AT_prototyped  : 1
    <db3>   DW_AT_type        : <0xa5b>
    <db7>   DW_AT_low_pc      : 0x0
    <dbb>   DW_AT_high_pc     : 0x14
    <dbf>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <dc1>   DW_AT_call_all_calls: 1
 <1><dc1>: Abbrev Number: 7 (DW_TAG_subprogram)
    <dc2>   DW_AT_external    : 1
    <dc2>   DW_AT_name        : (indirect string, offset: 0x7ae67): HAL_GetUIDw0
    <dc6>   DW_AT_decl_file   : 1
    <dc6>   DW_AT_decl_line   : 464
    <dc8>   DW_AT_decl_column : 10
    <dc9>   DW_AT_prototyped  : 1
    <dc9>   DW_AT_type        : <0xa5b>
    <dcd>   DW_AT_low_pc      : 0x0
    <dd1>   DW_AT_high_pc     : 0x14
    <dd5>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <dd7>   DW_AT_call_all_calls: 1
 <1><dd7>: Abbrev Number: 7 (DW_TAG_subprogram)
    <dd8>   DW_AT_external    : 1
    <dd8>   DW_AT_name        : (indirect string, offset: 0x7b1a9): HAL_GetDEVID
    <ddc>   DW_AT_decl_file   : 1
    <ddc>   DW_AT_decl_line   : 455
    <dde>   DW_AT_decl_column : 10
    <ddf>   DW_AT_prototyped  : 1
    <ddf>   DW_AT_type        : <0xa5b>
    <de3>   DW_AT_low_pc      : 0x0
    <de7>   DW_AT_high_pc     : 0x18
    <deb>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <ded>   DW_AT_call_all_calls: 1
 <1><ded>: Abbrev Number: 7 (DW_TAG_subprogram)
    <dee>   DW_AT_external    : 1
    <dee>   DW_AT_name        : (indirect string, offset: 0x7ac8b): HAL_GetREVID
    <df2>   DW_AT_decl_file   : 1
    <df2>   DW_AT_decl_line   : 439
    <df4>   DW_AT_decl_column : 10
    <df5>   DW_AT_prototyped  : 1
    <df5>   DW_AT_type        : <0xa5b>
    <df9>   DW_AT_low_pc      : 0x0
    <dfd>   DW_AT_high_pc     : 0x18
    <e01>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <e03>   DW_AT_call_all_calls: 1
 <1><e03>: Abbrev Number: 7 (DW_TAG_subprogram)
    <e04>   DW_AT_external    : 1
    <e04>   DW_AT_name        : (indirect string, offset: 0x7afdb): HAL_GetHalVersion
    <e08>   DW_AT_decl_file   : 1
    <e08>   DW_AT_decl_line   : 423
    <e0a>   DW_AT_decl_column : 10
    <e0b>   DW_AT_prototyped  : 1
    <e0b>   DW_AT_type        : <0xa5b>
    <e0f>   DW_AT_low_pc      : 0x0
    <e13>   DW_AT_high_pc     : 0x14
    <e17>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <e19>   DW_AT_call_all_calls: 1
 <1><e19>: Abbrev Number: 6 (DW_TAG_subprogram)
    <e1a>   DW_AT_external    : 1
    <e1a>   DW_AT_name        : (indirect string, offset: 0x7aced): HAL_ResumeTick
    <e1e>   DW_AT_decl_file   : 1
    <e1e>   DW_AT_decl_line   : 413
    <e20>   DW_AT_decl_column : 13
    <e21>   DW_AT_prototyped  : 1
    <e21>   DW_AT_low_pc      : 0x0
    <e25>   DW_AT_high_pc     : 0x1c
    <e29>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <e2b>   DW_AT_call_all_calls: 1
 <1><e2b>: Abbrev Number: 6 (DW_TAG_subprogram)
    <e2c>   DW_AT_external    : 1
    <e2c>   DW_AT_name        : (indirect string, offset: 0x7ae95): HAL_SuspendTick
    <e30>   DW_AT_decl_file   : 1
    <e30>   DW_AT_decl_line   : 397
    <e32>   DW_AT_decl_column : 13
    <e33>   DW_AT_prototyped  : 1
    <e33>   DW_AT_low_pc      : 0x0
    <e37>   DW_AT_high_pc     : 0x1c
    <e3b>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <e3d>   DW_AT_call_all_calls: 1
 <1><e3d>: Abbrev Number: 25 (DW_TAG_subprogram)
    <e3e>   DW_AT_external    : 1
    <e3e>   DW_AT_name        : (indirect string, offset: 0x7aedc): HAL_Delay
    <e42>   DW_AT_decl_file   : 1
    <e43>   DW_AT_decl_line   : 371
    <e45>   DW_AT_decl_column : 13
    <e46>   DW_AT_prototyped  : 1
    <e46>   DW_AT_low_pc      : 0x0
    <e4a>   DW_AT_high_pc     : 0x48
    <e4e>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <e50>   DW_AT_call_all_tail_calls: 1
    <e50>   DW_AT_sibling     : <0xe82>
 <2><e54>: Abbrev Number: 17 (DW_TAG_formal_parameter)
    <e55>   DW_AT_name        : (indirect string, offset: 0x7b69c): Delay
    <e59>   DW_AT_decl_file   : 1
    <e59>   DW_AT_decl_line   : 371
    <e5b>   DW_AT_decl_column : 32
    <e5c>   DW_AT_type        : <0xa5b>
    <e60>   DW_AT_location    : 2 byte block: 91 6c 	(DW_OP_fbreg: -20)
 <2><e63>: Abbrev Number: 13 (DW_TAG_variable)
    <e64>   DW_AT_name        : (indirect string, offset: 0x7ac67): tickstart
    <e68>   DW_AT_decl_file   : 1
    <e68>   DW_AT_decl_line   : 373
    <e6a>   DW_AT_decl_column : 12
    <e6b>   DW_AT_type        : <0xa5b>
    <e6f>   DW_AT_location    : 2 byte block: 91 70 	(DW_OP_fbreg: -16)
 <2><e72>: Abbrev Number: 13 (DW_TAG_variable)
    <e73>   DW_AT_name        : (indirect string, offset: 0x7b21a): wait
    <e77>   DW_AT_decl_file   : 1
    <e77>   DW_AT_decl_line   : 374
    <e79>   DW_AT_decl_column : 12
    <e7a>   DW_AT_type        : <0xa5b>
    <e7e>   DW_AT_location    : 2 byte block: 91 74 	(DW_OP_fbreg: -12)
 <2><e81>: Abbrev Number: 0
 <1><e82>: Abbrev Number: 7 (DW_TAG_subprogram)
    <e83>   DW_AT_external    : 1
    <e83>   DW_AT_name        : (indirect string, offset: 0x7adeb): HAL_GetTickFreq
    <e87>   DW_AT_decl_file   : 1
    <e87>   DW_AT_decl_line   : 355
    <e89>   DW_AT_decl_column : 21
    <e8a>   DW_AT_prototyped  : 1
    <e8a>   DW_AT_type        : <0xc8f>
    <e8e>   DW_AT_low_pc      : 0x0
    <e92>   DW_AT_high_pc     : 0x14
    <e96>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <e98>   DW_AT_call_all_calls: 1
 <1><e98>: Abbrev Number: 26 (DW_TAG_subprogram)
    <e99>   DW_AT_external    : 1
    <e99>   DW_AT_name        : (indirect string, offset: 0x7b019): HAL_SetTickFreq
    <e9d>   DW_AT_decl_file   : 1
    <e9e>   DW_AT_decl_line   : 322
    <ea0>   DW_AT_decl_column : 19
    <ea1>   DW_AT_prototyped  : 1
    <ea1>   DW_AT_type        : <0xc5e>
    <ea5>   DW_AT_low_pc      : 0x0
    <ea9>   DW_AT_high_pc     : 0x50
    <ead>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <eaf>   DW_AT_call_all_tail_calls: 1
    <eaf>   DW_AT_sibling     : <0xee1>
 <2><eb3>: Abbrev Number: 17 (DW_TAG_formal_parameter)
    <eb4>   DW_AT_name        : (indirect string, offset: 0x7b5e6): Freq
    <eb8>   DW_AT_decl_file   : 1
    <eb8>   DW_AT_decl_line   : 322
    <eba>   DW_AT_decl_column : 55
    <ebb>   DW_AT_type        : <0xc8f>
    <ebf>   DW_AT_location    : 2 byte block: 91 6f 	(DW_OP_fbreg: -17)
 <2><ec2>: Abbrev Number: 13 (DW_TAG_variable)
    <ec3>   DW_AT_name        : (indirect string, offset: 0x7ae8e): status
    <ec7>   DW_AT_decl_file   : 1
    <ec7>   DW_AT_decl_line   : 324
    <ec9>   DW_AT_decl_column : 21
    <eca>   DW_AT_type        : <0xc5e>
    <ece>   DW_AT_location    : 2 byte block: 91 77 	(DW_OP_fbreg: -9)
 <2><ed1>: Abbrev Number: 13 (DW_TAG_variable)
    <ed2>   DW_AT_name        : (indirect string, offset: 0x7b128): prevTickFreq
    <ed6>   DW_AT_decl_file   : 1
    <ed6>   DW_AT_decl_line   : 325
    <ed8>   DW_AT_decl_column : 23
    <ed9>   DW_AT_type        : <0xc8f>
    <edd>   DW_AT_location    : 2 byte block: 91 76 	(DW_OP_fbreg: -10)
 <2><ee0>: Abbrev Number: 0
 <1><ee1>: Abbrev Number: 7 (DW_TAG_subprogram)
    <ee2>   DW_AT_external    : 1
    <ee2>   DW_AT_name        : (indirect string, offset: 0x7ad74): HAL_GetTickPrio
    <ee6>   DW_AT_decl_file   : 1
    <ee6>   DW_AT_decl_line   : 313
    <ee8>   DW_AT_decl_column : 10
    <ee9>   DW_AT_prototyped  : 1
    <ee9>   DW_AT_type        : <0xa5b>
    <eed>   DW_AT_low_pc      : 0x0
    <ef1>   DW_AT_high_pc     : 0x14
    <ef5>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <ef7>   DW_AT_call_all_calls: 1
 <1><ef7>: Abbrev Number: 7 (DW_TAG_subprogram)
    <ef8>   DW_AT_external    : 1
    <ef8>   DW_AT_name        : (indirect string, offset: 0x7b273): HAL_GetTick
    <efc>   DW_AT_decl_file   : 1
    <efc>   DW_AT_decl_line   : 304
    <efe>   DW_AT_decl_column : 17
    <eff>   DW_AT_prototyped  : 1
    <eff>   DW_AT_type        : <0xa5b>
    <f03>   DW_AT_low_pc      : 0x80003c8
    <f07>   DW_AT_high_pc     : 0x14
    <f0b>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <f0d>   DW_AT_call_all_calls: 1
 <1><f0d>: Abbrev Number: 6 (DW_TAG_subprogram)
    <f0e>   DW_AT_external    : 1
    <f0e>   DW_AT_name        : (indirect string, offset: 0x7ab63): HAL_IncTick
    <f12>   DW_AT_decl_file   : 1
    <f12>   DW_AT_decl_line   : 293
    <f14>   DW_AT_decl_column : 13
    <f15>   DW_AT_prototyped  : 1
    <f15>   DW_AT_low_pc      : 0x80003a4
    <f19>   DW_AT_high_pc     : 0x24
    <f1d>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <f1f>   DW_AT_call_all_calls: 1
 <1><f1f>: Abbrev Number: 27 (DW_TAG_subprogram)
    <f20>   DW_AT_external    : 1
    <f20>   DW_AT_name        : (indirect string, offset: 0x7ad84): HAL_InitTick
    <f24>   DW_AT_decl_file   : 1
    <f25>   DW_AT_decl_line   : 234
    <f26>   DW_AT_decl_column : 26
    <f27>   DW_AT_prototyped  : 1
    <f27>   DW_AT_type        : <0xc5e>
    <f2b>   DW_AT_low_pc      : 0x8000344
    <f2f>   DW_AT_high_pc     : 0x60
    <f33>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <f35>   DW_AT_call_all_tail_calls: 1
    <f35>   DW_AT_sibling     : <0xf49>
 <2><f39>: Abbrev Number: 28 (DW_TAG_formal_parameter)
    <f3a>   DW_AT_name        : (indirect string, offset: 0x7ad3f): TickPriority
    <f3e>   DW_AT_decl_file   : 1
    <f3f>   DW_AT_decl_line   : 234
    <f40>   DW_AT_decl_column : 48
    <f41>   DW_AT_type        : <0xa5b>
    <f45>   DW_AT_location    : 2 byte block: 91 74 	(DW_OP_fbreg: -12)
 <2><f48>: Abbrev Number: 0
 <1><f49>: Abbrev Number: 18 (DW_TAG_subprogram)
    <f4a>   DW_AT_external    : 1
    <f4a>   DW_AT_name        : (indirect string, offset: 0x7ac7d): HAL_MspDeInit
    <f4e>   DW_AT_decl_file   : 1
    <f4e>   DW_AT_decl_line   : 211
    <f4f>   DW_AT_decl_column : 13
    <f4f>   DW_AT_prototyped  : 1
    <f4f>   DW_AT_low_pc      : 0x0
    <f53>   DW_AT_high_pc     : 0xc
    <f57>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <f59>   DW_AT_call_all_calls: 1
 <1><f59>: Abbrev Number: 18 (DW_TAG_subprogram)
    <f5a>   DW_AT_external    : 1
    <f5a>   DW_AT_name        : (indirect string, offset: 0x7aad6): HAL_MspInit
    <f5e>   DW_AT_decl_file   : 1
    <f5e>   DW_AT_decl_line   : 200
    <f5f>   DW_AT_decl_column : 13
    <f5f>   DW_AT_prototyped  : 1
    <f5f>   DW_AT_low_pc      : 0x0
    <f63>   DW_AT_high_pc     : 0xc
    <f67>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <f69>   DW_AT_call_all_calls: 1
 <1><f69>: Abbrev Number: 19 (DW_TAG_subprogram)
    <f6a>   DW_AT_external    : 1
    <f6a>   DW_AT_name        : (indirect string, offset: 0x7af8b): HAL_DeInit
    <f6e>   DW_AT_decl_file   : 1
    <f6e>   DW_AT_decl_line   : 175
    <f6f>   DW_AT_decl_column : 19
    <f6f>   DW_AT_prototyped  : 1
    <f6f>   DW_AT_type        : <0xc5e>
    <f73>   DW_AT_low_pc      : 0x0
    <f77>   DW_AT_high_pc     : 0x30
    <f7b>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <f7d>   DW_AT_call_all_tail_calls: 1
 <1><f7d>: Abbrev Number: 19 (DW_TAG_subprogram)
    <f7e>   DW_AT_external    : 1
    <f7e>   DW_AT_name        : (indirect string, offset: 0x7264d): HAL_Init
    <f82>   DW_AT_decl_file   : 1
    <f82>   DW_AT_decl_line   : 142
    <f83>   DW_AT_decl_column : 19
    <f83>   DW_AT_prototyped  : 1
    <f83>   DW_AT_type        : <0xc5e>
    <f87>   DW_AT_low_pc      : 0x8000318
    <f8b>   DW_AT_high_pc     : 0x2c
    <f8f>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <f91>   DW_AT_call_all_tail_calls: 1
 <1><f91>: Abbrev Number: 0
  Compilation Unit @ offset 0xf92:
   Length:        0xa83 (32-bit)
   Version:       5
   Unit Type:     DW_UT_compile (1)
   Abbrev Offset: 0x65c
   Pointer Size:  4
 <0><f9e>: Abbrev Number: 24 (DW_TAG_compile_unit)
    <f9f>   DW_AT_producer    : (indirect string, offset: 0x4ec7b): GNU C11 11.3.1 20220712 -mcpu=cortex-m3 -mfloat-abi=soft -mthumb -march=armv7-m -g3 -O0 -std=gnu11 -ffunction-sections -fdata-sections -fstack-usage -fcyclomatic-complexity
    <fa3>   DW_AT_language    : 29	(C11)
    <fa4>   DW_AT_name        : (indirect string, offset: 0x7b289): ../Drivers/STM32F1xx_HAL_Driver/Src/stm32f1xx_hal_cortex.c
    <fa8>   DW_AT_comp_dir    : (indirect string, offset: 0x123a4): F:/HEATER SYSTEM PID/CODE/Debug
    <fac>   DW_AT_ranges      : 0x15d
    <fb0>   DW_AT_low_pc      : 0x0
    <fb4>   DW_AT_stmt_list   : 0x2663
    <fb8>   DW_AT_macros      : 0x153ee
 <1><fbc>: Abbrev Number: 25 (DW_TAG_enumeration_type)
    <fbd>   DW_AT_encoding    : 5	(signed)
    <fbe>   DW_AT_byte_size   : 1
    <fbf>   DW_AT_type        : <0x1103>
    <fc3>   DW_AT_decl_file   : 4
    <fc4>   DW_AT_decl_line   : 69
    <fc5>   DW_AT_decl_column : 1
    <fc6>   DW_AT_sibling     : <0x1103>
 <2><fca>: Abbrev Number: 6 (DW_TAG_enumerator)
    <fcb>   DW_AT_name        : (indirect string, offset: 0x7ad60): NonMaskableInt_IRQn
    <fcf>   DW_AT_const_value : -14
 <2><fd0>: Abbrev Number: 6 (DW_TAG_enumerator)
    <fd1>   DW_AT_name        : (indirect string, offset: 0x7acfc): HardFault_IRQn
    <fd5>   DW_AT_const_value : -13
 <2><fd6>: Abbrev Number: 6 (DW_TAG_enumerator)
    <fd7>   DW_AT_name        : (indirect string, offset: 0x7af3c): MemoryManagement_IRQn
    <fdb>   DW_AT_const_value : -12
